{"https://www.foxnews.com/politics/harris-and-hirono-question-federal-judicial-nominee-over-knights-of-columbus-membership": {"content": "Senators Kamala Harris and Mazie Hirono are criticizing Trump judicial nominee Brian Buescher for his membership in the Roman Catholic charitable organization The Knights of Columbus. Two Democratic senators are scrutinizing a federal judicial nominee over his membership in the Knights of Columbus, drawing a stern rebuke from the Catholic organization. Sens. Kamala Harris, D-Calif., and Mazie Hirono, D-Hawaii, raised concerns about Omaha-based lawyer Brian Buescher's membership as part of the Senate Judiciary Committee's review of his nomination by President Trump to sit on the U.S. District Court in Nebraska, as first reported <a href=\"https://www.catholicnewsagency.com/news/senators-quiz-nominee-about-membership-of-extreme-knights-of-columbus-78683\">by the Catholic News Agency</a>. In a series of questions sent to Buescher, Hirono asked whether his membership in the Knights of Columbus would prevent him from hearing cases “fairly and impartially” and, if confirmed, whether he would end his membership in the Roman Catholic charitable organization. “The Knights of Columbus has taken a number of extreme positions,” Hirono said in the questionnaire. “For example, it was reportedly one of the top contributors to California’s Proposition 8 campaign to ban same-sex marriage.” <a href=\"https://www.judiciary.senate.gov/imo/media/doc/Buescher%20Responses%20to%20QFRs.pdf\">In his response</a>, Buescher argued that the Knights of Columbus’ official positions on issues do not represent every one of the group’s members and said he would recuse himself from hearing cases where he saw a conflict of interest. “The Knights of Columbus does not have the authority to take personal political positions on behalf of all of its approximately two million members,” Buescher wrote. “If confirmed, I will apply all provisions of the Code of Conduct for United States Judges regarding recusal and disqualification.” Harris, in her questions to the nominee, called the Knights of Columbus “an all-male society” and asked the Nebraska lawyer if he was aware that the group was anti-abortion and anti-gay marriage when he joined. The California senator also referenced Supreme Knight Carl A. Anderson’s statement that abortion amounted to “the killing of the innocent on a massive scale” and asked Buescher if he agreed with the statement. Buescher responded that his involvement in the group consisted mostly of charitable work and community events at his local Catholic parish. He indicated he would abide by judicial precedent regarding abortion. The Knights of Columbus maintained that its positions reflect Catholic teachings, and suggested that the senators' scrutiny amounts to criticism of the Catholic faith. Kathleen Blomquist, a spokesperson for the Knights of Columbus, blasted the questions by Hirono and Harris as a throwback to past anti-Catholic rhetoric. “Our country’s sad history of anti-Catholic bigotry contributed to the founding of the Knights of Columbus, and we are proud of the many Catholics who overcame this hurdle to contribute so greatly to our country,” she told the CNA. Blomquist added: “We were extremely disappointed to see that one’s commitment to Catholic principles through membership in the Knights of Columbus—a charitable organization that adheres to and promotes Catholic teachings—would be viewed as a disqualifier from public service in this day and age.” The Knights of Columbus was founded in the U.S. in 1882 as a society for working-class and immigrant Catholics. It has since expanded to include charitable services, including war and disaster relief, and the promotion of Catholic education. The group, however, has come under controversy for some of its official stances on issues like abortion and same-sex marriage, as well as its political activity. This is not the first time that one of Trump's judicial nominees has faced questions tied to faith, either. In 2017, federal judicial nominee Amy Barrett -- a professor at Notre Dame Law School and a devout Catholic -- was questioned by Democratic senators about how her faith would influence her decisions from the bench. Barrett was eventually confirmed as a circuit judge on the U.S. Court of Appeals for the Seventh Circuit.", "authors": "Andrew O'Reilly", "title": "Dem senators challenge Trump judge pick over membership in group"}, "https://www.foxnews.com/politics/battle-of-the-billionaires-brewing-trump-could-meet-his-match-in-2020": {"content": "<source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1470/828/billionaires-2.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1862/1048/billionaires-2.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/640/320/1862/1048/billionaires-2.jpg?ve=1&amp;tl=1?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p class=\"speakable\">Donald Trump is the richest president in U.S. history – but as he gears up for a re-election campaign, the real estate magnate could end up facing off against someone even wealthier. The budding 2020 field of potential challengers includes no fewer than four fellow billionaires. The wealthiest of the pack, by far, is former New York City Mayor Michael Bloomberg. The media mogul and gun control advocate’s net worth is estimated at nearly $52 billion, according to the latest Forbes 400 Richest Americans list. That dwarfs Trump, whose wealth is estimated by Forbes at $3.1 billion (though Trump has claimed his net worth is higher). Bloomberg may be the best-known of the billionaires eyeing a bid – and the most likely to take the plunge, given recent trips to early-voting states and a public switch back to the Democratic Party after years as an independent – but several others have stirred speculation. <strong><a href=\"https://www.foxnews.com/apps-products\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> They include: Hedge fund-manager-turned-environmental-activist Tom Steyer (worth $1.6 billion, says Forbes); former Starbucks CEO Howard Schultz (worth $3.3 billion); and investor and Dallas Mavericks owner Mark Cuban (worth $3.9 billion). It’s unclear if any of them would decide to run. While Cuban reportedly is flirting with a White House bid as a Republican or independent, the other three would be entering a sprawling Democratic field that includes high-profile senators and several former presidential candidates. At least on the Democratic side, their immense wealth could amount to a double-edged sword. Like Trump, they would have the ability to self-finance – which would help not only flood the airwaves with commercials but assert their political independence from special interests. Trump wouldn’t be the only one who could claim he’s not for sale with donors. “What it can do is keep you in the race a lot longer than somebody who’s not able to raise money and it obviously allows you to get your message out, whatever that is,” said Adrienne Elrod, a Democratic strategist who served as senior aide on Hillary Clinton’s 2016 presidential campaign. At the same time, their wealth could become a liability, as they seek the nomination in a party where all the energy is with the progressive wing. “I think it’s an uphill battle for a billionaire in the Democratic Party in a way that is distinct from the Republican Party,” said Neil Sroka, communications director for the progressive group Democracy for America. “It’s not necessarily going to hurt them, but it’s definitely not going to help them.” Sroka noted the “income inequality” issue will be front and center in the Democratic primary. “It’s not as if it’s a cross to bear, but it’s something that they’re going to have to talk about and be forthright with throughout the primary process,” he said. For now, Bloomberg is attracting the most attention among the billionaires. He took a highly visible swipe at the president over the weekend, <a href=\"https://www.bloomberg.com/opinion/articles/2018-12-23/shutdown-stock-slump-and-mattis-exit-cap-grim-year-for-trump\">with a blistering column for his media company decrying</a> Trump's \"recklessly emotional and senselessly chaotic approach to the job.\" A former Republican turned independent who returned to the Democratic Party this year, Bloomberg made stops in the early caucus and primary voting states of Iowa and New Hampshire this past fall, fueling speculation he’s gearing up for a White House run. “He’s done a lot of good in his post-mayoral life with his wealth and he’s espoused a lot of progressive values as part of that,” Elrod said of Bloomberg’s efforts to battle gun violence and his vow to make climate change the defining issue in 2020. But she added that “the biggest thing that’s going to hurt him more than his personal wealth is the fact that he used to be a Republican.” She said that would be a “far bigger liability” competing in “a very left-leaning progressive grassroots primary.” <strong><a href=\"https://www.foxnews.com/politics/2020-democratic-prospects-making-early-moves-in-iowa\">2020 DEM PROSPECTS MAKE EARLY MOVES IN IOWA</a></strong> Steyer, meanwhile, has attracted attention spending millions on a campaign to impeach the president. The former hedge fund manager – who’s said he’ll decide on a White House run early in the new year – kicked off a town hall tour this month in South Carolina, the first southern state to vote in the primary and caucus calendar. That tour will also bring him to New Hampshire, Iowa and Nevada, other early-voting states. Steyer has also built up a vast email distribution list through his “Need to impeach” drive and NextGenAmerica, the grassroots advocacy organization he created five years ago. “When you think of Tom Steyer, the first thing Democratic voters think of is he’s for impeachment, which is not a bad thing, because he’s able to get his message out and break through,” Elrod said. But she questioned whether the impeachment push would actually translate to primary votes. Schultz, who suffers from a lack of name recognition compared with some of the other uber-wealthy potential candidates, has hired a major public relations team and is expected to crisscross the country early in 2019 as he promotes a new book. For any of these businessmen who enter politics, strategists say the message will matter more than the money. “You can bring a lot of big money in, but we just saw in some of our recent elections here that that doesn’t mean at the end of the day that you’re going to be the one with your name on the ballot,” Zandra Rice-Hawkins, executive director of the New Hampshire-based progressive group Granite State Progress, said. Ultimately, a hurdle for these candidates may be whether any of them can represent change in a party torn between the old and new guard, after rallying behind Clinton in 2016 only to see the establishment choice narrowly lose to Trump. “I don’t know that the Democrats are necessarily interested in a candidate like [the billionaires] rather than somebody who is younger or who speaks to questions of diversity or who is going to run a much more unabashedly liberal or progressive campaign,” Saint Anselm College politics professor Christopher Galdieri said.", "title": "Super-rich potential candidates all hinting at bids to topple Trump in 2020"}, "https://www.foxnews.com/world/netanyahu-calls-early-israel-election-for-april-in-bid-for-fourth-straight-term": {"content": "<span class=\"dateline\">JERUSALEM – </span>Prime Minister Benjamin Netanyahu on Monday called early elections for April, setting the stage for a three-month campaign clouded by a series of corruption investigations against the long-serving Israeli leader. Riding high in the polls, Netanyahu appears all but certain to win a fourth consecutive term and a place in history as the country's longest-serving prime minister. Those bright prospects, however, could be derailed by a looming decision by the country's attorney general on whether to file charges against Netanyahu. Netanyahu, facing the possibility of bribery and breach of trust charges in three different cases, made scant mention of these investigations at a gathering of his Likud Party as he announced plans for what is expected to be an April 9 vote. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Appearing loose and confident, he listed his government's accomplishments in office and said he hoped his current religious, nationalistic coalition would be the \"core\" of Israel's next government as well. \"We will ask the voters for a clear mandate to continue leading the state of Israel our way,\" he said to applause from party members. Netanyahu, who also served a term in the late 1990s, has been prime minister for the past decade. His supporters point to a humming, high-tech economy, his handling of security issues, particularly countering the threat of Iranian influence in the region, and his gains on the diplomatic stage, including a close alliance with President Donald Trump that has paid important dividends. Pete Hegseth talks with Israeli Prime Minister Benjamin Netahyahu. Trump's recognition of Jerusalem as Israel's capital and his withdrawal from the international nuclear deal were both welcomed by Netanyahu. The Israeli leader also has quietly forged ties with Sunni Arab states, further sidelining the Palestinians, who have severed ties with the U.S. because they believe Trump is biased against them. The White House still has not released a long-awaited peace plan, and Monday's announcement could further delay its release. But critics say these gains have come at a deep price to Israel's democratic ideals. Netanyahu's hard-line government has promoted a series of laws that critics say are aimed at muzzling liberal critics and sidelining the minority Arab population. They point to wide gaps between rich and poor and high cost of living, and say that by neglecting the Palestinian issue and continuing to build settlements in the West Bank, the country is on the path to becoming an apartheid-like binational state. Former Prime Minister Ehud Barak called the election \"the most fateful\" since the assassination of then-Prime Minister Yitzhak Rabin in 1995. \"If we all act properly, on April 10 we will part with Netanyahu,\" he said on Hahadashot TV. \"The state of Israel will get on a different path instead of this nationalist, racist, dark vision.\" Israeli Prime Minister Benjamin Netanyahu's son temporarily blocked from Facebook after a post criticizing the social media platform for removing a post in which he called on Muslims to leave Israel. Barak called for the country's dovish and centrist parties to band together in a unified \"bloc\" in a bid to topple Likud. Yair Lapid, leader of the centrist Yesh Atid party, said the election was a battle for the \"soul of the country.\" For now, there does not appear to be anyone with the popularity or gravitas to topple Netanyahu. One wild card is Benny Gantz, a popular former military chief who is flirting with the idea of entering politics. Opposition parties have been aggressively courting Gantz. But for now, he has not committed to joining any party. Instead, the biggest threat appears to be posed by Attorney General Avichai Mandelblit, who must soon decide on whether to indict the prime minister. Earlier this month, police recommended that Netanyahu be charged with bribery for promoting regulatory changes worth hundreds of millions of dollars to the country's main telecom company Bezeq. In exchange, they believe Netanyahu used his connections with Bezeq's controlling shareholder to receive positive press coverage on the company's popular news site. Police have also recommended indicting Netanyahu on corruption charges in two other cases. One involves accepting gifts from billionaire friends, and the second revolves around alleged offers of advantageous legislation for a major newspaper in return for favorable press coverage. Arrests come after two deadly shootings are blamed on the terror group; Trey Yingst report from the West Bank on the week of heavy violence. Netanyahu has denied any wrongdoing and said he is the victim of a media-fueled witch hunt. At Monday's Likud meeting, Netanyahu brushed off a reporter's question and said he expected the investigations to lead nowhere. Mandelblit has not said when he expects to make a decision. The Justice Ministry announced Monday that deliberations were continuing and were \"not dependent on political events.\" Israeli law is unclear about whether a sitting prime minister must resign if charged with a crime, and Netanyahu has hinted that he will remain in office to fight any indictment. But criminal charges, and the distraction of a protracted legal battle, could fuel calls for him to step aside. Finance Minister Moshe Kahlan, a key ally, said Monday that a prime minister \"cannot serve\" if he is indicted following a required hearing. Reuven Hazan, a political scientist at Israel's Hebrew University, said the campaign would be dominated by \"a discussion of whether Netanyahu should stay after, if he is prosecuted.\" He said Netanyahu had settled on the April election, roughly seven months ahead of schedule, in part to \"pre-empt\" an indictment. The thinking is that it would be politically difficult for Mandelblit to indict, and potentially topple, a popular, newly re-elected prime minister. \"He wants to turn around to the attorney general and say `before you decide to prosecute me pay attention. The people of Israel have re-elected me for a fourth time,\"' Hazan explained. An electoral victory would send a message that \"you cannot overturn the results of a democratic election,\" he said. Palestinian militant groups announce they've agreed to a cease-fire with Israel to stop the heaviest fighting between them in years; Benjamin Hall reports from Sderot, Israel. Netanyahu's coalition has been roiled by internal divisions for months. Avigdor Lieberman, leader of a small, ultranationalist party, resigned as defense minister last month to protest what he perceived to be the government's weak response to rocket attacks from Hamas-ruled Gaza. That left Netanyahu with a fragile majority of just 61 seats in the 120-seat parliament. But a new bill extending the military draft to Jewish ultra-Orthodox men appeared to be the final trigger for the government's downfall. Ultra-Orthodox parties consider conscription a taboo. As a deadline for the legislation loomed, his religious coalition partners were demanding the legislation be weakened. Earlier Monday, Lapid, a harsh critic of the religious parties, said he was rescinding his support for the draft bill, saying the planned compromise essentially rewarded draft dodgers. As a result, Netanyahu convened his fellow coalition faction leaders and the decision was made to dissolve parliament and go to elections.", "title": "Netanyahu calls early Israel election for April in bid for fourth straight term"}, "http://insider.foxnews.com/2018/12/24/dan-bongino-rips-bob-corker-over-really-gross-shot-president-donald-trump": {"content": "Dan Bongino slammed Tennessee Sen. Bob Corker Monday on \"Fox &amp; Friends\" after he <a href=\"https://www.foxnews.com/politics/corker-calls-govt-shutdown-made-up-fight-so-trump-can-look-like-hes-fighting-and-winning\" target=\"_blank\">took a shot at President Trump</a> over the weekend. Corker has increasingly criticized the president since the Republican senator announced he wouldn't run for a third term. In an interview Sunday, Corker said that Trump's fight for a border wall, which led to a partial government shutdown, was \"made up.\" \"This is a made-up fight so the president can look like he's fighting,\" he said. \"But even if he wins, our borders are gonna be insecure.\" <strong><a href=\"/2018/12/24/michael-bloomberg-blasts-donald-trump-new-op-ed-calls-his-presidency-terrible\">'Recklessly Emotional': Bloomberg Slams Trump in Op-Ed, Calls His Presidency 'Terrible'</a></strong> Bongino called Corker's comments \"gross\" on Monday and backed Trump's calls for stronger border enforcement. \"For him to abandon the president right now is really gross and shows he has no spine, and I'm glad he left office,\" Bongino, a former Secret Service agent, said. During Sunday's interview, Corker urged the American public to focus on a \"significant thing like pulling out of Syria.\" Trump criticized the senator on Twitter following his remarks, noting that he refused to endorse him. .....Bob Corker was responsible for giving us the horrible Iran Nuclear Deal, which I ended, yet he badmouths me for wanting to bring our young people safely back home. Bob wanted to run and asked for my endorsement. I said NO and the game was over. <a href=\"https://twitter.com/hashtag/MAGA?src=hash&amp;ref_src=twsrc%5Etfw\">#MAGA</a> I LOVE TENNESSEE! — Donald J. Trump (@realDonaldTrump) <a href=\"https://twitter.com/realDonaldTrump/status/1076935567760338944?ref_src=twsrc%5Etfw\">December 23, 2018</a> Bongino added on Monday that Democrats \"don't want to give Donald Trump a victory,\" which is why they won't compromise on border security. \"They are focused on one thing and one thing only: that's impeachment or a devastating loss for him in re-election,\" he said. Watch more of Dan Bongino's interview from \"Fox &amp; Friends\" above. <strong><a href=\"/2018/12/24/ronald-reagans-son-warns-trump-he-has-no-choice-build-border-wall\">'It's Now or Never': Reagan's Son Warns President Trump He Has 'No Choice' But to Build Border Wall</a></strong> <strong><a href=\"/2018/12/24/new-jersey-boy-has-christmas-wish-bringing-army-dad-home-granted\">NJ Boy's Christmas Wish of Bringing Army Dad Home Granted With Surprise School Assembly</a></strong> <strong><a href=\"/2018/12/23/greg-gutfeld-show-introduces-pc-santa\">WATCH: Greg Gutfeld Show Introduces Gluten-Free, Eco-Friendly 'P.C. Santa'</a></strong>", "title": "'He has no spine': Bongino rips GOP Sen. Corker over 'really gross' shot at Trump"}, "https://www.foxnews.com/politics/maine-gop-congressman-ends-legal-challenge-to-democrats-victory": {"content": "U.S. Rep. Bruce Poliquin, R-Maine, announced Monday that he was ending his legal challenge to the election of his Democratic opponent under the state's new ranked-choice voting system. In a statement posted to Facebook, Poliquin wrote that \"despite winning the largest number of votes on Election Day, I believe it's in the best interest of my constituents and all Maine citizens to close this confusing and unfair chapter of voting history by ending any further legal proceedings.\" \"I’ve done everything possible to protect the one-person, one-vote Constitutional right of my fellow Mainers,\" Poliquin added. \"For over 100 years in our State’s history, the candidate who received the most votes won. Elections here have always been straightforward and non-controversial.\" <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Poliquin's defeat by Jared Golden means that all 12 representatives for the six New England states are Democrats. Democrats will have at least 235 seats in the new House of Representatives next year with the outcome of a contested race in North Carolina still pending. Poliquin also said that he wished Golden the best during the coming term. Golden said in a statement that he looked forward to getting to work and thanked Poliquin for his service to the state and \"the spirited campaign he ran in 2018.\" Poliquin received approximately 2,000 more first-place votes than Golden on Election Day, only for Golden to surge ahead once second preferences from ballots supporting two other independent candidates were re-allocated.  The two-term incumbent argued that the system was unconstitutional and requested that the courts either declare him the winner or order another election be held. Earlier this month, U.S. District Judge Lance Walker said critics could question the wisdom of ranked-choice voting, but such criticism \"falls short of constitutional impropriety.\" Poliquin also lost a last-ditch bid to challenge Golden's scheduled Jan. 3 swearing-in by asking the courts to halt the certification of election results. <strong><a href=\"https://www.foxnews.com/politics/ranked-choice-voting-litmus-test-in-maine-could-pave-way-for-other-states\">RANKED</a></strong><strong><a href=\"https://www.foxnews.com/politics/ranked-choice-voting-litmus-test-in-maine-could-pave-way-for-other-states\"> CHOICE VOTING LITMUS TEST IN MAINE COULD PAVE WAY FOR OTHER STATES</a></strong> Maine became the first state to allow voters to rank candidates on the ballots in a congressional race. Maine's top state court last year warned that ranked-choice voting conflicts with the state's constitution, which says the winners of state-level races are whoever gets the most votes, or a \"plurality.\" So Maine uses ranked-choice voting only in federal elections and state primary races, but not for general elections for governor or the Legislature. Democratic Gov.-elect Janet Mills has vowed to seek to amend the state constitution so the system can be used in all elections. <em>The Associated Press contributed to this report.</em>", "authors": "Samuel Chamberlain", "title": "Maine GOP congressman ends legal challenge to Democrat's victory"}, "https://www.foxnews.com/politics/all-alone-trump-prods-dems-to-deal-on-border-wall-as-partial-shutdown-drags-on": {"content": "Former assistant secretary of state for President George W. Bush weighs in on the partial government shutdown. With no compromise in sight to end the partial government shutdown, President Trump on Monday urged Democratic leaders to \"make a deal\" on border security -- while those lawmakers countered that mixed messages from the White House are \"making it impossible to know where they stand.\" The back-and-forth on Christmas Eve signaled a stalemate likely to last through the holiday week and possibly into the new year. Trump, on a busy day of tweeting, weighed in with a social media appeal claiming he's \"all alone\" waiting for Democrats to return to the negotiating table. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> “I am all alone (poor me) in the White House waiting for the Democrats to come back and make a deal on desperately needed Border Security,” Trump tweeted. “At some point the Democrats not wanting to make a deal will cost our Country more money than the Border Wall we are all talking about. Crazy!” The partial government shutdown was triggered Friday at midnight, as funding lapsed for numerous agencies without a deal between the White House and Congress on Trump's request for money to build a U.S.-Mexico border wall. While both sides are trading offers to end the stalemate, they remain far apart, and a top White House official warned the shutdown could stretch into January. But there could be some movement. Acting White House chief of staff Mick Mulvaney, who is also the budget director, said he was waiting to hear from Senate Democratic leader Chuck Schumer about a counteroffer the White House presented Schumer over the weekend. Mulvaney would only say the offer was between Trump's $5.7 billion request and the $1.3 billion Democrats have offered. \"We moved off of the five and we hope they move up from their 1.3,\" Mulvaney said. A Democratic aide told the Associated Press that the offer from the White House on Saturday was $2.5 billion -- an initial $2.1 billion plus $400 million Democrats called a \"slush fund\" for the president's other immigration priorities. But Democrats complained Monday that it's unclear what Trump would actually accept. “[D]ifferent people from the same White House are saying different things about what the president would accept or not accept to end his Trump Shutdown, making it impossible to know where they stand at any given moment,” House Speaker-designate Nancy Pelosi, D-Calif., and Schumer, D-N.Y., said in a joint statement. “The president wanted the shutdown, but he seems not to know how to get himself out of it.” Senate negotiators are continuing talks behind the scenes with Democrats and Republicans. The House and Senate gaveled into session for a few minutes on Christmas Eve before quickly closing again with no further action. The White House, meanwhile, said Trump was meeting Monday afternoon with DHS Secretary Kristjen Nielsen and other department officials \"to discuss border security.\" In an earlier tweet on Monday, Trump blamed the Democrats for the stalemate: \"Virtually every Democrat we are dealing with today strongly supported a Border Wall or Fence. It was only when I made it an important part of my campaign, because people and drugs were pouring into our Country unchecked, that they turned against it. Desperately needed!\" The partial government closure affects hundreds of thousands of federal workers across the country and is expected to last at least through Thursday, when the House and Senate meet again. Monday and Tuesday, Christmas Eve and Christmas, respectively, are federal holidays, meaning the government would have been closed anyway. That means Wednesday is the first day the public could begin to feel the effects of lost government services, Mulvaney said. Mulvaney predicted the shutdown could go into January, when Democrats assume control of the House. \"It's very possible that this shutdown will go beyond the 28th and into the new Congress,\" he said. Mulvaney appeared on \"Fox News Sunday\" and ABC's \"This Week.\" <em>The Associated Press contributed to this report.</em>", "authors": "Andrew O'Reilly", "title": "‘All alone’ Trump prods Dems to confer on border wall amid partial shutdown"}, "https://www.foxnews.com/politics/trump-brags-about-contract-for-wall-texas-blames-dems-for-partial-shutdown": {"content": " President Trump took to Twitter early Christmas Eve evening to brag about his latest border-wall accomplishment while blaming Democrats for the stalemate that has shut down part of the federal government. He tweeted Monday: “I am in the Oval Office &amp; just gave out a 115 mile long contract for another large section of the Wall in Texas. We are already building and renovating many miles of Wall, some complete. Democrats must end Shutdown and finish funding. Billions of Dollars, &amp; lives, will be saved!” It’s unclear whether Trump’s tweet means a new contract or an existing one. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Little headway has been made on the wall, despite Trump’s tweet, echoing one of his original promises as president while on the campaign trail. A March bill included money for 33 miles of barrier construction in South Texas’ Rio Grande Valley, but work there has yet to begin. <a href=\"https://www.foxnews.com/us/145m-border-wall-project-in-texas-awarded-customs-and-border-protection-says\">Customs and Border Protection announced in early November</a> a $145 million construction project was awarded to build roughly six miles of border wall in Texas. The agency, in conjunction with the Army Corps of Engineers, gave the multimillion-dollar job in the Border Patrol’s Rio Grande Valley Sector to SLSCO, which is expected to kick off in February. Other work has merely replaced existing barriers that had been deemed “ineffective,” not added miles. It looks like Christmas will be over and done with before the government will have a chance to get fully back to business. The incoming <a href=\"https://www.foxnews.com/politics/all-alone-trump-prods-dems-to-deal-on-border-wall-as-partial-shutdown-drags-on\">acting White House Chief of Staff Mick Mulvaney said</a> the partial shutdown could drag into the New Year. Monday and Tuesday, Christmas Eve and Christmas, respectively, are federal holidays, meaning the government is closed anyway. That means Wednesday is the first day the public could begin to feel the effects of lost government services, Mulvaney said. Funding for numerous departments and agencies expired Saturday. The disruption is affecting many operations and some 800,000 federal employees. Both the House and Senate have adjourned until later in the week. The president’s border-security meeting Monday afternoon included Homeland Security Secretary Kirstjen Nielsen and other department officials, White House Press Secretary Sarah Sanders said. Senate negotiators continued talks behind the scenes with Democrats and Republicans. The House and Senate briefly gaveled into session on Christmas Eve before closing again with no further action. The White House insisted Trump will reject any deal that does not include money for a wall or fence; Democrats held firm in their opposition to a wall or other physical barrier. As Republicans prepare to relinquish their hold on government, with Democrats taking control of the House in January, the opportunities — and limits — of the GOP alliance with the Trump White House may be running their course. <a href=\"https://www.foxnews.com/us/judge-blocks-deportation-of-honduran-mother-without-daughter\"><strong>JUDGE BLOCKS DEPORTATION OF HONDURAN MOTHER WITHOUT HER DAUGHTER</strong></a> No sooner had Trump signaled he might be backing off his demand for $5 billion to build a border wall with Mexico — easing away from a partial government shutdown — than he took a U-turn after being scolded by conservative allies and pundits, who accused him of wavering on a campaign promise. “Trump is plunging the country into chaos,” the Democratic leaders Nancy Pelosi and Chuck Schumer said in a joint statement on Christmas Eve. “Instead of bringing certainty into people’s lives, he’s continuing the Trump Shutdown just to please right-wing radio and TV hosts.” Trump told Republican leaders at the White House last week he wouldn’t sign a Senate-passed compromise bill, which would have kept border security money at $1.3 billion. <em>The Associated Press contributed to this report.</em>", "authors": "Frank Miles", "title": "Trump brags about contract for wall in Texas, blames Dems for partial shutdown"}, "https://www.foxnews.com/politics/dems-accused-of-religious-bigotry-for-questioning-trump-court-picks-knights-of-columbus-ties": {"content": " Following <a href=\"https://www.foxnews.com/politics/harris-and-hirono-question-federal-judicial-nominee-over-knights-of-columbus-membership\">questions from multiple Democratic senators</a> over the impartiality of Trump judicial nominee Brian Buescher and his ties to the Knights of Columbus, a charitable Roman Catholic organization, Republicans and various religious leaders hit back Monday against “religious bigotry.” “This isn’t just about the Knights of Columbus or Catholics, this is an ongoing attack from the extremist left of the Democratic Party to silence people of faith and run them out of engaging in public service based on their religious beliefs,” Penny Nance, the president of Concerned Women for America, a Christian women’s activist group, said in a written statement. “It is pure and simple religious bigotry,” Nance added.  <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Sens. Kamala Harris, D-Calif., and Mazie Hirono, D-Hawaii, recently raised concerns about Buescher's membership as part of the Senate Judiciary Committee's review of his nomination by President Trump to sit on the U.S. District Court in Nebraska. <a href=\"https://www.catholicnewsagency.com/news/senators-quiz-nominee-about-membership-of-extreme-knights-of-columbus-78683\">The Catholic News Agency (CNA)</a> first reported news of their concerns. In a series of questions sent to Buescher, Hirono asked whether his membership in the Knights of Columbus would prevent him from hearing cases “fairly and impartially” and, if confirmed, whether he would end his membership in the organization. “The Knights of Columbus has taken a number of extreme positions,” Hirono said in the questionnaire. “For example, it was reportedly one of the top contributors to California’s Proposition 8 campaign to ban same-sex marriage.” Harris meantime, in her questions to the nominee, called the Knights of Columbus “an all-male society” and asked the Nebraska lawyer if he was aware that the group was anti-abortion and anti-gay marriage when he joined. The California senator also referenced Supreme Knight Carl A. Anderson’s statement that abortion amounted to “the killing of the innocent on a massive scale” and asked Buescher if he agreed with the statement. “The Knights of Columbus does not have the authority to take personal political positions on behalf of all of its approximately two million members,” Buescher wrote in <a href=\"https://www.judiciary.senate.gov/imo/media/doc/Buescher%20Responses%20to%20QFRs.pdf\">reply to the queries</a>. “If confirmed, I will apply all provisions of the Code of Conduct for United States Judges regarding recusal and disqualification.” Prominent Republicans and religious leaders backed Buescher in the face of the questions. “Hopefully, in the eyes of Democrats you are not disqualified to a be a judge because of your religious affiliations and beliefs,” GOP South Carolina Sen. Lindsey Graham <a href=\"https://twitter.com/LindseyGrahamSC/status/1077260236786987008\">tweeted</a>. “The Knights of Columbus are a Catholic charitable organization who have genuinely held beliefs about marriage &amp; abortion.” “Will not tolerate disqualifying judicial nominees because of charitable works and personal religious opinions,” Graham wrote in a follow-up <a href=\"https://twitter.com/LindseyGrahamSC/status/1077260488550039552\">tweet</a>. \"The Black Church is very concerned because we know that when elected leaders attack Catholic organizations like the Knights of Columbus for believing timeliness Christian principles, then all people of faith are at risk,” Rev. Eugene F. Rivers III, a civil rights leader and the director of the Seymour Institute for Black Church and Policy Studies, said in a statement. “There is no place for a religious test like this in our country,” he continued. “Our constitution forbids it and elected leaders should know better than to try to impose it.\" This is the kind of thuggish behavior we expect from third world dictators, not United States Senators. \"This is the kind of thuggish behavior we expect from third world dictators, not United States Senators,\" Ken Blackwell, a former U.S. Ambassador to the United Nations Human Rights Commission, said in a statement. \"That this attack on Catholics comes from the party of John F. Kennedy, who was proudly a Knight of Columbus, is particularly shocking and egregious. There should be no religious test in America, and I call on my Democratic friends to end this tactic of engaging in religious discrimination to destroy people nominated for public office.\" “Alarming questions from Senate Democrats, showing they are getting more and more comfortable with imposing religious tests on Federal judicial nominees,” the office of Sen. Orrin Hatch, R-Utah, <a href=\"https://twitter.com/senorrinhatch/status/1076657983713533953\">tweeted</a> over the weekend. Kathleen Blomquist, a spokeswoman for the Knights of Columbus, blasted the questions by Hirono and Harris as a throwback to past anti-Catholic rhetoric. “Our country’s sad history of anti-Catholic bigotry contributed to the founding of the Knights of Columbus, and we are proud of the many Catholics who overcame this hurdle to contribute so greatly to our country,” she told the CNA. Despite the pointed questions of the nominee and the implications of the interrogations, Knights of Columbus Senior Vice President Kevin Shinkle said the organization has valued the backing it's received. “The Knights of Columbus is grateful for the support of so many people who recognize our charitable efforts and understand that mainstream religious beliefs shouldn’t disqualify anyone from serving their country,” Shinkle said in a statement to Fox News. <i>Fox News’ Andrew O’Reilly contributed to this report.</i>", "authors": "Matt Richardson", "title": "Dems slammed for questioning Trump court pick’s Knights of Columbus ties"}, "https://www.foxnews.com/us/california-gov-brown-orders-new-dna-testing-in-35-year-old-murders": {"content": "A California inmate charged in a decades-old murder case could get a second chance after Democratic Gov. Jerry Brown on Monday ordered new DNA tests related to the killings. Kevin Cooper has argued that he was framed for the 1983 Chino Hills hatchet and knife killings of four people. Brown ordered a T-shirt, towel, a sheath and a hatchet handle discovered near the scene to be tested. Brown also appointed a retired Los Angeles County Superior Court judge to serve as a special master overseeing the case. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Cooper was convicted of killing Doug and Peggy Ryen, their 10-year-old daughter Jessica and 11-year-old neighbor Christopher Hughes in 1985. Prosecutors said Cooper's claims of innocence have been disproven multiple times, including by prior DNA testing, but Cooper and his attorney argued evidence against him was planted. Now they will have an opportunity to prove their case. \"I take no position as to Mr. Cooper's guilt or innocence at this time, but colorable factual questions have been raised about whether advances in DNA technology warrant limited retesting of certain physical evidence in this case,\" Brown wrote in his executive order. The purpose of the new testing, he wrote, would be to determine whether another suspect's DNA or the DNA of any other identifiable suspect is on the items. If the tests reveal no new DNA or DNA that cannot be traced to a person, \"this matter should be closed,\" Brown wrote. Following the announcement of the order, Kim Kardashian, <a href=\"https://www.foxnews.com/entertainment/kim-kardashian-advocates-for-alice-johnson-others-who-are-jailed\">a vocal advocate for criminal justice reform</a>, tweeted in support, labeling it \"such amazing news.\" Brown issued his Christmas Eve order alongside 143 pardons and 131 commutations. They are expected to be his last clemency actions as governor, but he has until he leaves office Jan. 7 to act. <i>The Associated Press contributed to this report.</i>", "authors": "Matt Richardson", "title": "California Gov. Brown orders new DNA testing in 35-year-old murders"}}