{"https://www.foxnews.com/sports/cleveland-browns-baker-mayfield-appears-to-stare-down-former-coach-hue-jackson-during-game": {"content": "Cleveland Browns' quarterback Baker Mayfield appears to have stared down former coach Hue Jackson after a successful pass with tight end David Njoku on a 66-yard catch and run that sealed the win. Cleveland Browns quarterback Baker Mayfield appeared to reignite his budding personal rivalry with ex-Browns head coach and current Cincinnati Bengals consultant Hue Jackson on Sunday during Cleveland's 26-18 win. In the fourth quarter, Mayfield connected with tight end David Njoku on a 66-yard catch and run that sealed the win, with Mayfield then taking three snaps out of the victory formation as the clock wound down. But after the big pass to Njoku, Mayfield was seen running downfield staring at Jackson. The rookie also appeared to backpedal in an effort to get a longer look at Jackson. Mayfield downplayed the incident when asked about it in the postgame press conference. “No, no idea what you are talking about,” he said, according to <a href=\"https://www.cleveland.com/browns/2018/12/baker-mayfield-stares-down-hue-jackson-but-plays-it-coy.html\" target=\"_blank\">Cleveland.com</a>. “Yeah.” <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Mayfield has expressed his displeasure with Jackson since the former Browns head coach was fired earlier in the season. Jackson was hired to be a consultant under Bengals head coach Marvin Lewis soon after his dismissal in Cleveland. Mayfield <a href=\"https://www.foxnews.com/sports/cleveland-browns-players-take-shots-at-former-head-coach-in-revenge-victory\" target=\"_self\">refused to embrace Jackson</a> when the two met at midfield during their matchup in November. He later said he wasn’t happy with Jackson taking the job with the Bengals. “Left Cleveland, goes down to Cincinnati, I don’t know. It’s just somebody that was in our locker room, asking for us to play for him and then goes to a different team we play twice a year,” Mayfield told reporters. “Everybody can have their spin on it but that’s how I feel.”", "authors": "Ryan Gaydos", "title": "WATCH: Star QB celebrates big play by taunting former boss who benched him"}, "https://www.foxnews.com/politics/harris-and-hirono-question-federal-judicial-nominee-over-knights-of-columbus-membership": {"content": "Senators Kamala Harris and Mazie Hirono are criticizing Trump judicial nominee Brian Buescher for his membership in the Roman Catholic charitable organization The Knights of Columbus. Two Democratic senators are scrutinizing a federal judicial nominee over his membership in the Knights of Columbus, drawing a stern rebuke from the Catholic organization. Sens. Kamala Harris, D-Calif., and Mazie Hirono, D-Hawaii, raised concerns about Omaha-based lawyer Brian Buescher's membership as part of the Senate Judiciary Committee's review of his nomination by President Trump to sit on the U.S. District Court in Nebraska, as first reported <a href=\"https://www.catholicnewsagency.com/news/senators-quiz-nominee-about-membership-of-extreme-knights-of-columbus-78683\">by the Catholic News Agency</a>. In a series of questions sent to Buescher, Hirono asked whether his membership in the Knights of Columbus would prevent him from hearing cases “fairly and impartially” and, if confirmed, whether he would end his membership in the Roman Catholic charitable organization. “The Knights of Columbus has taken a number of extreme positions,” Hirono said in the questionnaire. “For example, it was reportedly one of the top contributors to California’s Proposition 8 campaign to ban same-sex marriage.” <a href=\"https://www.judiciary.senate.gov/imo/media/doc/Buescher%20Responses%20to%20QFRs.pdf\">In his response</a>, Buescher argued that the Knights of Columbus’ official positions on issues do not represent every one of the group’s members and said he would recuse himself from hearing cases where he saw a conflict of interest. “The Knights of Columbus does not have the authority to take personal political positions on behalf of all of its approximately two million members,” Buescher wrote. “If confirmed, I will apply all provisions of the Code of Conduct for United States Judges regarding recusal and disqualification.” Harris, in her questions to the nominee, called the Knights of Columbus “an all-male society” and asked the Nebraska lawyer if he was aware that the group was anti-abortion and anti-gay marriage when he joined. The California senator also referenced Supreme Knight Carl A. Anderson’s statement that abortion amounted to “the killing of the innocent on a massive scale” and asked Buescher if he agreed with the statement. Buescher responded that his involvement in the group consisted mostly of charitable work and community events at his local Catholic parish. He indicated he would abide by judicial precedent regarding abortion. The Knights of Columbus maintained that its positions reflect Catholic teachings, and suggested that the senators' scrutiny amounts to criticism of the Catholic faith. Kathleen Blomquist, a spokesperson for the Knights of Columbus, blasted the questions by Hirono and Harris as a throwback to past anti-Catholic rhetoric. “Our country’s sad history of anti-Catholic bigotry contributed to the founding of the Knights of Columbus, and we are proud of the many Catholics who overcame this hurdle to contribute so greatly to our country,” she told the CNA. Blomquist added: “We were extremely disappointed to see that one’s commitment to Catholic principles through membership in the Knights of Columbus—a charitable organization that adheres to and promotes Catholic teachings—would be viewed as a disqualifier from public service in this day and age.” The Knights of Columbus was founded in the U.S. in 1882 as a society for working-class and immigrant Catholics. It has since expanded to include charitable services, including war and disaster relief, and the promotion of Catholic education. The group, however, has come under controversy for some of its official stances on issues like abortion and same-sex marriage, as well as its political activity. This is not the first time that one of Trump's judicial nominees has faced questions tied to faith, either. In 2017, federal judicial nominee Amy Barrett -- a professor at Notre Dame Law School and a devout Catholic -- was questioned by Democratic senators about how her faith would influence her decisions from the bench. Barrett was eventually confirmed as a circuit judge on the U.S. Court of Appeals for the Seventh Circuit.", "authors": "Andrew O'Reilly", "title": "Dem senators challenge Trump judge pick over membership in group"}, "https://www.foxnews.com/sports/late-hit-on-chicago-bears-mitchell-trubisky-sparks-brawl-leads-to-ejections": {"content": "Sunday's game between the San Francisco 49ers and the Chicago Bears erupted into a brawl between the teams after a late hit on Bears quarterback Mitchell Trubisky by 49ers defensive back Marcell Harris. A late hit on Chicago Bears quarterback Mitchell Trubisky sparked a brawl on the sideline in the fourth quarter during a game against the San Francisco 49ers on Sunday. With under six minutes to play, Trubisky snapped the ball and dropped back but couldn’t find any receivers open. He took it upon himself to run for the first down and as he was sliding to avoid getting hit, he was tackled by 49ers defensive back Marcell Harris. Harris’ hit on the Bears sideline sparked a fight with the safety and Trubisky in the middle of the skirmish. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Bears wide receivers Anthony Miller and Joshua Bellamy, along with 49ers cornerback Richard Sherman, were ejected from the game following the play. Trubisky’s first down was also erased on the ensuing penalties. Sherman spoke about the ejection after the game, according to <a href=\"https://twitter.com/nwagoner/status/1077006891216134144\" target=\"_blank\">ESPN</a>. “I'm a grown man; you don't grab, pull on me -- I don't put my hands on you, you don't put your hands on me,” he told reporters. “You put your hands on me, you're gonna feel me.” The Bears defeated the 49ers, 14-9.", "authors": "Ryan Gaydos", "title": "WATCH: Late hit on star quarterback sparks wild fight in NFL game"}, "https://www.foxnews.com/entertainment/michael-weatherly-took-jessica-alba-virginity-when-she-was-a-teen": {"content": "Actress Eliza Dushku accused 'Bull' co-star Michael Weatherly of sexual harassment and was written off the series before she was granted a secret $9.5 million settlement from CBS, The New York Times reports. Before actress Eliza Dushku <a href=\"https://www.foxnews.com/entertainment/eliza-dushku-got-secret-9-5-million-settlement-from-cbs-after-accusing-michael-weatherly-of-sexual-harassment\">won a $9.5 million settlement from CBS</a> over harassment by the network's \"Bull\" star Michael Weatherly, he dated Jessica Alba when she was a just teen, and took her virginity. Alba, then 18, and Weatherly, who was 30 at the time, dated for a few years after they met on the set of Fox's \"Dark Angel\" in 2000. He proposed on her 20th birthday — despite their nearly 13-year age gap, and her born-again Christian parents' disapproval. She <a href=\"https://www.cosmopolitan.com/entertainment/celebs/news/a1640/jessica-alba-interview/\" target=\"_blank\">later told Cosmo</a>, \"Relationships can be tough . . . I've only had two boyfriends. In the first one, with Michael [Weatherly], I didn't have a voice yet, and he was so much older . . . I was so young, 18, when I started dating him. I was a virgin. I knew I wanted to be in love with the first person I slept with, because for almost everyone I knew, the first experience made them feel like s–t . . . I wanted to be careful that he was going to be in love with me, and wasn't just going to leave me.\" They split in 2003, and Alba got her first tattoo. She later told Stephen Colbert, \"He was really anti-tattoos, and I felt like after I broke up with him, I, like, found myself again.\" The \"Fantastic Four\" star is now happily married to Cash Warren, with whom she has three children. It was just revealed that Weatherly, 50, a regular on CBS's primetime lineup for 15 years, made sexually inappropriate comments to Dushku, 37, on the 2017 set of \"Bull,\" including a rape joke and a comment about a threesome. She was fired when she complained, and later won a settlement from CBS. <a href=\"https://www.foxnews.com/entertainment/eliza-dushku-breaks-silence-on-michael-weatherly-sexual-harassment-allegations\" target=\"_blank\"><strong>ELIZA DUSHKU BREAKS SILENCE ON MICHAEL WEATHERLY SEXUAL HARASSMENT ALLEGATIONS</strong></a> Weatherly, who wed Bojana Jankovic in 2009, said the comments were \"jokes mocking some lines in the script . . . what I said was both not funny and not appropriate, and I am sorry.\" But Dushku added in an op-ed this week, \"It is easy to see how uncomfortable, speechless and frozen he made me feel. For Weatherly's part, it looks like a deeply insecure power play, about a need to dominate and demean . . . What is hardest to share, is the way he made me feel for 10 to 12 hours per day for weeks . . . I was made to feel dread nearly all the time I was in his presence.\" <em>This article <a href=\"https://pagesix.com/2018/12/23/michael-weatherly-took-jessica-albas-virginity-when-she-was-a-teen/\" target=\"_blank\">originally appeared</a> on Page Six.</em>", "title": "Actress talks about relationship with ex-'NCIS' star facing lewd accusations"}, "https://www.foxnews.com/world/saudi-national-charged-in-fatal-hit-and-run-of-oregon-teen-believed-to-have-made-escape-back-home-report-says": {"content": "Federal authorities reportedly believe Saudi Arabia helped one of its citizens -- who was charged in the fatal hit-and-run of a 15-year-old Oregon girl -- attain a passport and flee the United States. Abdulrahman Sameer Noorah was arrested in August 2016 and indicted for first-degree manslaughter, hit-and-run, reckless endangerment and reckless driving after allegedly <a href=\"https://www.foxnews.com/us/saudi-student-now-us-fugitive-after-skipping-on-bail-posted-by-government\" target=\"_blank\">killing Fallon Smart in Portland</a>. On Sept. 11, 2016, Noorah’s $100,000 bond was posted by the consulate of Saudi Arabia, according to court records, and in early June 2017, he removed his monitoring device and vanished. His whereabouts were thought to be unknown until U.S. officials learned from the Saudi government he had returned to the Kingdom, <a href=\"https://www.oregonlive.com/expo/news/erry-2018/12/9b5b1eff724150/he-was-accused-of-killing-a-po.html\" target=\"_blank\">The Oregonian</a> reported Sunday. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> “We’re doing everything we can to get him back,” supervisory U.S. Marshal Eric Wahlstrom told The Oregonian. The U.S. does not have an extradition treaty with Saudi Arabia. Noorah had been a student in Portland since 2014 and had been receiving just over $1,800-a-month as a stipend from the Saudi government for living expenses, according to the newspaper. He is from Jeddah and was housed by a host mother. Noorah was jailed on $1 million bail after the deadly accident and, under Oregon law, a defendant must post at least 10 percent of the bail to be released. The consulate reportedly paid $100,000. He was then placed into the supervision of the Multnomah County Sheriff’s Office and returned to the Portland house where he had been living. He was allowed to continue going to classes at Portland Community College while his case proceeded but was initially placed under house arrest. On June 10, Noorah was allowed to study on campus after receiving permission from his release supervisor. Later that afternoon, however, he was picked up in a black GMC Yukon XL and had his monitoring bracelet cut. It wasn’t until the next evening his release supervisor discovered he was gone. Investigators later discovered a bag packed at the home. After the U.S. launched an international manhunt for Noorah, the Saudi government reached out to the Department of Homeland Security in July and told officials Noorah returned to Saudi Arabia on June 17. Federal officials believe Noorah was given a passport with a different identity to help him get out of the U.S., according to The Oregonian. The Kingdom of Saudi Arabia has on several occasions paid bail for its nationals who've been charged with crimes – including a man accused of rape in Utah in 2015, who also fled and was subsequently convicted, and for a Missouri resident in 2013 who was accused but later acquitted of murdering a bar owner. That same year the government put up $5 million bail for a Saudi princess charged with human trafficking in California, yet those charges, too, were dropped.", "authors": "Ryan Gaydos", "title": "Saudi national charged in fatal hit-and-run of Oregon teen believed to have escaped to Kingdom, report says"}, "http://insider.foxnews.com/2018/12/24/new-jersey-boy-has-christmas-wish-bringing-army-dad-home-granted": {"content": "A New Jersey boy asked Santa Claus to grant a very special wish this Christmas: bring his Army soldier father home for the holidays. Abel Towers-Zeller wrote down his wish, asking St. Nick to bring home his dad, Pvt. Timothy Zeller, and for his \"family to stay healthy.\" <a href=\"https://www.nj.com/expo/news/erry-2018/12/e51d29bfa32762/army-dad-comes-home-surprises.html\" target=\"_blank\">According to NJ.com</a>, Pvt. Zeller has been stationed in Southern California, and father and son haven't seen each other since July. They were reunited at a surprise assembly last week at Abel's school, in Old Bridge, after his family worked with school faculty to plan the emotional reunion. It was an honor to be present as this military family reunited for the holidays. My sincerest thank you to Timothy Zeller and the entire Zeller family for your service and all that you give for our country. Merry Christmas! <a href=\"https://t.co/RySLbr1DVI\">pic.twitter.com/RySLbr1DVI</a> — Kathleen Hoeker (@OBassistantsup) <a href=\"https://twitter.com/OBassistantsup/status/1074766450047500291?ref_src=twsrc%5Etfw\">December 17, 2018</a> <strong><a href=\"/2018/12/21/ken-starr-reports-mueller-probe-could-end-mid-february-little-optimistic\">Ken Starr: Reports Mueller Probe Could End by Mid-February Are 'Little Bit Optimistic'</a></strong> \"[Abel's] jaw just dropped when he finally realized it was me walking into the gym,\" Pvt. Zeller said Monday on \"Fox &amp; Friends.\" He said that due to the time differences from the West and East coasts, it's difficult to find the right time to speak to his family. \"That makes it rough, definitely,\" he said. Abel, though, said he tells his friends all the time how his dad is helping the United States. NJ.com reported that Pvt. Zeller will be home in New Jersey until Dec. 28. <strong><a href=\"/2018/12/23/syracuse-recruit-cooper-dawson-best-friend-kingsley-feinman-reflect-viral-signing-day\">'I'll Never Forget This': Syracuse Recruit, Best Friend Reflect on Touching Signing Day Moment</a></strong> <strong><a href=\"/2018/12/22/robert-jeffress-responds-luis-gutierrez-border-rant-bible-says-even-heaven-gonna-have\">Rev. Jeffress on Dem Rep's Border Rant: 'Bible Says Even Heaven Is Gonna Have a Wall Around It'</a></strong> <strong><a href=\"/2018/12/22/washington-dc-bar-offers-federal-employees-5-dollar-shutdown-cocktails\">LOOK: Washington, D.C. Bar Offers Federal Employees $5 'Shutdown Cocktails'</a></strong>", "title": "WATCH: Army soldier dad surprises young son by coming home for Christmas"}, "https://www.foxnews.com/entertainment/meghan-markle-urged-to-end-the-rift-with-her-father-in-christmas-card-from-half-sister": {"content": "Meghan Markle's half-sister, Samantha Grant, wants to dispel rumors about her family resulting from vicious media scrutiny stemming from the royal engagement announcement. <a href=\"https://www.foxnews.com/category/entertainment/celebrity-news/meghan-markle\" target=\"_blank\">Meghan Markle'</a>s half-sister reportedly sent the Duchess of Sussex a Christmas card urging her to \"end the rift\" with their father. Samantha Markle asked her half-sister to make contact with their father, Thomas Markle, in order to bring about joy in him during the last few years of his life, <a href=\"http://www.mirror.co.uk/news/uk-news/meghan-markles-sister-sends-emotional-13768941\" target=\"_blank\">The Mirror reported</a>. Thomas Markle has been suffering from heart trouble and reportedly fears he might not make it to next Christmas. \"This is not meant to be formal. The holidays are a time for family and are sentimental. As you know, dad has been trying to contact you and is very hurt because you are avoiding him,\" the card reads, according to The Mirror. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> \"Life is short and you know dad is wonderful. Please give him joy in his last years by showing that you love him. The time is NOW. Please think about this.\" Samantha, 54, also told The Mirror her father could die before next Christmas and fears her half-sister could live to regret not repairing her relationship with her father before he dies. \"I think Meg would harbor a lot of regret if this were his last Christmas alive and she didn't reach out and make things right,\" she told the UK tabloid. \"There is not another day or week guaranteed, so Meg needs to act quickly. The clock is ticking.\" <a href=\"https://www.foxnews.com/entertainment/meghan-markle-family-feud-2018\" target=\"_blank\">The drama between Meghan and her father</a> came to light in the days leading up to her marriage to Prince Harry. Thomas Markle vowed to be at the wedding despite controversy over staged photographs and his health issues. He ended up not attending the wedding and was forced to deny rumors he had asked for money from Meghan days before her wedding. Thomas had also been in the British tabloids, saying his daughter wasn’t happy after joining the royal family. He also told <a href=\"https://www.dailymail.co.uk/news/article-6475167/Meghans-father-Thomas-Markle-reveals-sweet-cards-proof-did-wedding.html\" target=\"_blank\">The Mail on Sunday</a> earlier this month he had made \"dozens\" of attempts to contact Meghan via texts and letters and received no response. Meghan Markle hasn’t commented on the rift with her father.", "authors": "Ryan Gaydos", "title": "Meghan Markle's family feud takes another dramatic turn"}, "https://www.foxnews.com/world/arrests-in-morocco-backpacker-beheadings-foiled-terrorist-plot-investigators-reveal": {"content": "Three more suspects have been arrested in the murder of Louisa Vesterager Jespersen and Maren Ueland, two Scandinavian tourists who were killed in their tent in the Moroccan mountains. A \"terrorist plot\" was foiled by the Friday arrests of nine more men connected to the ISIS-inspired beheadings of two Scandinavian backpackers in Morocco, investigators revealed Sunday. The suspects were between the ages of 25 and 33 and were headed to the area where the women were beheaded with the intent to commit a crime, Boubker Sabik, a spokesman for the Moroccan security and domestic intelligence services, told Reuters. Sabik said the suspects were found with a variety of items including electronic devices, knives, bomb-making materials and unauthorized rifles. He did not elaborate about the plot itself. The arrests bring the total number of suspects in the case to 13. Four other men were arrested earlier in the murders of Maren Ueland, 28, of Norway, and Louisa Vesterager, 24, of Denmark. The women were found dead Monday with stab wounds on their neck near the village of Imlil, a starting point for treks to Mount Toubkal, North Africa's highest peak. <a href=\"http://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Sabik said while the suspects were seen in a video before the bodies were found pledging their allegiance to ISIS, the suspects were \"lone wolves.\" “The crime was not coordinated with Islamic State,” Sabik said. “Lone wolves do not need permission from their leader.\" <a href=\"https://www.foxnews.com/world/mother-of-murdered-scandinavian-tourist-sent-graphic-images-of-her-daughters-killing-report\"><strong>MOTHER OF MURDERED SCANDINAVIAN TOURIST WAS SENT GRAPHIC IMAGES OF HER DAUGHTER'S KILLING: REPORT</strong></a> Sabik added that authorities were continuing to investigate footage that allegedly showed one of the women being beheaded. \"The video has no background and the clothes of the victim are not identical to those in reality,\" Sabik said. Norwegian police last week said the video likely was authentic. Morocco is generally considered safe for tourists but has been rooting out Islamic extremists for years. <i>The Associated Press contributed to this report.</i>", "authors": "Nicole Darrah", "title": "Arrests tied to backpacker beheadings may have foiled deadly attack: report"}, "https://www.foxnews.com/world/missing-daughter-of-dubai-ruler-seen-in-newly-released-photos-by-uae": {"content": "The United Arab Emirates released photos Monday of the “missing” daughter of Dubai’s leader months <a href=\"https://www.foxnews.com/world/dubai-rulers-daughter-mysteriously-vanishes-after-attempt-to-escape-fathers-clutches-ex-spy-says\" target=\"_blank\">after she reportedly fled the Emirates</a>. Sheikha Latifa, daughter of Sheikh Mohammed bin Rashid Al Maktoum, Dubai's ruler and the UAE's prime minister and vice president, is seen in the photos with Mary Robinson, former U.N. High Commissioner for Human Rights. The government said in a statement that Sheikha Latifa, who met with Robinson on Dec. 15 at the family’s request, is “at home and living with her family in Dubai.” The photos show the two women smiling. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> The statement said they released the photos in an effort to refute “false allegations” that Latifa was missing. “During her visit to Dubai, Mary Robinson was reassured that H.H. Sheikha Latifa is receiving necessary care and support she requires,” the government said. Sheikha Latifa had previously appeared in a 40-minute video saying she was imprisoned off and on for several years and abused at the hands of her father. In March, it was reported that she had fled the Emirates. Friends and supporters say she disappeared after commandos stormed a boat carrying her off the coast of India. According to the Associated Press, Herve Jaubert, a French ex-spy, and her longtime friend, Tiina Jauhiainen, helped Sheikha Latifa escape into neighboring Oman. She then took a small boat to meet Jaubert and his crew aboard his U.S.-flagged sailboat, The Nostromo, the former spy said. They set sail for the Indian coast, but the ship was intercepted by commandos who stormed aboard. It was the last time Jauhiainen or Jaubert saw Sheikha Latifa in person. \"Latifa was determined to leave Dubai... She said it was worth taking any kind of risk as she had literally had enough of her life in Dubai,\" Jauhiainen told <a href=\"https://news.sky.com/story/missing-dubai-princess-pictured-alive-11590923\" target=\"_blank\">Sky News.</a> Until the release of the images on Monday, the 33-year-old royal had not been seen in public for more than nine months.", "title": "'Missing' daughter of Dubai ruler seen in new photos from United Arab Emirates"}, "https://www.foxnews.com/entertainment/flip-or-flop-star-christina-el-moussa-marries-ant-anstead-in-secret-wedding": {"content": "'Flip or Flop' star Christina El Moussa married Ant Anstead during a secret wedding in Newport Beach, California. The wedding was called a 'winter wonderland.' Their relationship wasn't a flop: \"Flip or Flop\" star Christina El Moussa has a new husband in TV presenter Ant Anstead after dating for just a year. The HGTV starlet tied the knot with Antstead in a \"winter wonderland\" wedding on Saturday, <a href=\"https://people.com/tv/christina-el-moussa-marries-ant-anstead/\" target=\"_blank\">People reports</a>. The couple married in Newport Beach, Calif., in front of 70 of their closest family and friends, who met at their home and were transported by charter bus to the ceremony in an effort to keep the nuptials a secret. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> El Moussa, 35, says her publicist and longtime pal, Cassie Zebisch, was key for keeping the wedding quiet. \"We literally owe this wedding to her,” El Moussa said. “She pulled it off. She met with the vendors, she set up the catering. I wanted a Maestros theme, like a nice steakhouse. She did it all!” “Every day we were checking the internet to see if anyone found out,” she added. “Then the day we went to get our marriage license, the guy working was like hyperventilating, excited. We had to tell him this is a huge secret. No one knows.” <a href=\"https://www.foxnews.com/entertainment/flip-or-flop-director-recalls-moment-tarek-christina-el-moussa-crossed-the-line-during-on-set-fight\" target=\"_blank\"><strong>CHRISTINA EL MOUSSA SAYS SHE CAN 'SEE HERSELF GETTING MARRIED TO' ANT ANSTEAD</strong></a> Thankfully, El Moussa says, “It was just perfect for us. Everything we wanted.” El Moussa also revealed that she plans on taking her new husband's last name. “It has a nice ring to it, doesn’t it? Christina Anstead,\" she gushed. \"We couldn’t be any happier!” The marriage is El Moussa's second, following her bitter split from \"Flip or Flop\" co-host and ex-husband Tarek El Moussa, with whom she shares daughter Taylor and son Brayden. <a href=\"https://www.foxnews.com/entertainment/christina-el-moussa-ant-anstead-celebrate-6-month-anniversary\" target=\"_blank\"><strong>CHRISTINA EL MOUSSA AND ANT ANSTEAD CELEBRATE SIX-MONTH ANNIVERSARY</strong></a> Tarek and Christina announced their separation in December 2016, six months after a <a href=\"https://pagesix.com/2016/12/12/hgtv-stars-split-after-alleged-suicide-threat/\" target=\"_blank\">heated fight</a> led to police being called to their Orange County, Calif., home. Christina <a href=\"https://www.foxnews.com/entertainment/flip-or-flops-christina-el-moussa-files-for-divorce\" target=\"_blank\">filed for divorce</a> from Tarek in September 2017; their divorce was <a href=\"https://www.foxnews.com/entertainment/christina-and-tarek-el-moussa-of-flip-or-flop-finalize-divorce\" target=\"_blank\">finalized</a> in January 2018.", "authors": "Jessica Sager", "title": "'Flip or Flop' star stuns fans by revealing big news"}, "https://www.foxnews.com/entertainment/cardi-b-gives-expletive-defense-in-why-she-was-spotted-with-ex-offset": {"content": " Rapper Cardi B defended herself over the weekend after she was spotted in Puerto Rico with her estranged husband Offset two weeks after announcing the pair had broken up. Cardi B assured fans in an explicit Instagram Live video that she and one-third of Migos weren’t back together, and gave a candid reason why she enjoyed spending time with him. “I just had to f—k,” the 26-year-old “I Like it” rapper said, according to <a href=\"https://people.com/music/cardi-b-not-back-with-offset-despite-reunion/\" target=\"_blank\">People</a>. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> “B---h feels baptized. I came back to f----n’ life, b---h.” The pair were spotted together on a jet ski in Puerto Rico last week. Offset was reportedly supporting Cardi B while she was set to perform on the island. Earlier this month, Cardi B announced that <a href=\"https://www.foxnews.com/entertainment/cardi-b-says-she-and-husband-offset-are-not-together-anymore\" target=\"_blank\">she and Offset split up</a>. “I’ve been trying to work things out with my baby’s father for a hot minute now. We’re really good friends and we’re really good business partners … but things just having been working out between us for a long time,” she said in an Instagram video. “And it’s nobody’s fault, I guess we just grew out of love, but we’re not together anymore,” adding “It might take time to get a divorce.”", "authors": "Ryan Gaydos", "title": "Rapper gives X-rated explanation after being spotted with her ex"}, "https://www.foxnews.com/world/thousands-evacuated-near-sydney-high-rise-after-cracking-noises-spur-fears-of-collapse": {"content": "The newly constructed Opal Tower in Sydeny has been evacuated after residents heard 'cracking' noises, sparking fears that the building was moving and could collapse. Thousands of people living near Sydney's Olympic Park are facing an uncertain Christmas Eve after residents of a newly opened apartment building reported unsettling noises, generating fears of a possible collapse and prompting evacuations Monday. Emergency responders were called to the Opal Tower on the city's west side across the street from the site of the 2000 Sydney Olympics after residents reported hearing \"cracking noises\" during the morning, New South Wales Police said in a statement. A resident of the Opal Tower told the <a href=\"https://www.9news.com.au/2018/12/24/16/46/sydney-olympic-park-building-evacuation-cracking-trains-police?ocid=Social-9News\" target=\"_blank\">Nine News network</a> he heard a \"big bang\" as if something in the building had \"snapped.\" Another resident <a href=\"https://www.abc.net.au/news/2018-12-24/sydney-opal-tower-cracking-building-evacuation/10666734\" target=\"_blank\">told ABC News</a> there were cracks on the building's 12th and 13th floors. \"I'm concerned, of course,\" he said. \"A few days ago the doors looked different, like they couldn't close properly. And you do feel (movement) sometimes when there's strong wind.\" Firefighters and engineers were expected to enter complex late Monday to examine what caused the reported cracks on its 10th floor and to determine whether the building is in danger of collapse. \"It's not going to be done in minutes. Hopefully, it won't take longer than hours,\" Fire and Rescue Acting Inspector Greg Wright told reporters. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Experts using sensitive monitoring equipment determined the $165 million building that opened in August had moved between 1 and 2 millimeters, according to police Detective Superintendent Philip Rogerson. The 36-story building includes 392 apartments, a retail area, and a childcare center, <a href=\"https://www.smh.com.au/national/nsw/opal-tower-residents-evacuated-after-concerns-building-may-collapse-20181224-p50o4b.html\" target=\"_blank\">according to the Sydney Morning Herald</a>. During the evacuation on Monday, the doors of the building became jammed and police had to break through using heavy equipment to let residents out, ABC reported. An exclusion zone with a radius of half a mile was established around the building, forcing the evacuation of neighboring buildings and the closure of roads and a train station,<a href=\"https://www.skynews.com.au/details/_5983146279001\" target=\"_blank\"> Sky News Australia reported</a>. About 3,000 people were forced from their homes. <strong><a href=\"https://www.foxnews.com/world/police-say-investigation-into-drones-over-gatwick-ongoing\" target=\"_blank\">POLICE SAY INVESTIGATION INTO DRONES OVER GATWICK ONGOING</a></strong> Water and gas services were shut off and the tower was being isolated from the power grid, Wright said. Meriton, the operator of the neighboring building, said in an email to residents that there was \"potential for the tower to collapse.\" A resident of a neighboring building told the Sydney Morning Herald he was on the way home from lunch with his wife when they noticed the roads were blocked off, and was could it could be as long as \"a couple of days\" before they could go back inside. <em>The Associated Press contributed to this report.</em>", "authors": "Travis Fedschun", "title": "Thousands evacuated near high-rise after cracking noises spur collapse fears"}, "https://www.foxnews.com/sports/some-of-the-most-gruesome-sports-injuries-of-2018": {"content": "Washington Redskins Quarterback Alex Smith’s right ankle bent in an awkward direction during a play against the Houston Texans. Smith was carted off the field. The year 2018 was magical for many athletes -- but some had to suffer through a gruesome injury that kept them out of a game or off the field for far longer. From broken legs to bloodied heads, here are some of the more memorable injuries over the last year. <strong>WARNING: GRAPHIC IMAGES BELOW</strong> <strong>ISAIAH CANAAN</strong> Phoenix Suns guard Isaiah Canaan suffered a <a href=\"https://www.foxnews.com/sports/graphic-video-suns-guard-isaiah-canaan-suffers-grisly-season-ending-ankle-injury\" target=\"_blank\">grisly ankle injury</a> in a Feb. 1 game against the Dallas Mavericks. While driving to the hoop, he got tangled up at the basket and landed awkwardly on his left ankle. Canaan’s teammates and several of his opponents were immediately horrified at Canaan’s dangling ankle. Devin Booker buried his face in his warm-up shirt, while Wesley Matthews walked away with his hands over his eyes. The injury ended Canaan's 2017-18 season. <strong>TYRONE CRAWFORD</strong> Dallas Cowboys defensive lineman Tyrone Crawford was taken <a href=\"https://www.foxnews.com/sports/dallas-cowboys-defensive-lineman-tyrone-crawford-carted-from-field-after-suffering-neck-injury\" target=\"_blank\">off the field Dec. 23</a> on a stretcher after she was injured during a play against the Tampa Bay Buccaneers. Crawford appeared to be injured after being hit in the neck by the shoulder of Buccaneers offensive lineman Ryan Jensen on the second play of the game. Crawford was released from the hospital hours after the injury. <strong>KRIS DUNN</strong> Chicago Bulls guard Kris Dunn <a href=\"https://www.foxnews.com/sports/graphic-video-chicago-bulls-kris-dunn-shatters-teeth-in-face-first-fall\" target=\"_blank\">dislocated two teeth</a> and suffered a concussion after taking a scary fall from a dunk in a Jan. 17 game against the Golden State Warriors. With 2 minutes and 52 seconds remaining in the fourth quarter, Dunn stole the ball and broke toward the net. He dunked the ball but the momentum carried him and he was unable to correct himself during the fall. Dunn missed some time due to his concussion. <strong>TYLER EIFERT</strong> The Cincinnati Bengals lost tight end Tyler Eifert <a href=\"https://www.foxnews.com/sports/cincinnati-bengals-tyler-eifert-suffers-gruesome-injury-in-game-season-in-jeopardy\" target=\"_blank\">for the season</a> on Sept. 30 after he suffered a gruesome lower right leg injury in the third quarter against the Atlanta Falcons. Eifert caught a pass from quarterback Andy Dalton and was immediately tackled by Falcons defenders De’Vondre Campbell and Jack Crawford. Eifert’s ankle appeared to snap back upon the tackle. The 28-year-old standout was down for several minutes before being carted off the field. His leg was stabilized by the medical staff as he was embraced by teammates on his way to the locker room. <strong>TYLER ENNIS</strong> Former NBA player Tyler Ennis was taken to the hospital after <a href=\"https://www.foxnews.com/sports/tyler-ennis-ex-nba-player-suffers-gruesome-ankle-injury-in-turkish-league-game\" target=\"_blank\">suffering a gruesome ankle</a> injury during a Turkish basketball league game on Oct. 21. Ennis, who is in his first season for Fenerbahce, was driving toward the basket in the first quarter when he collided with Malcolm Armstead, who plays for Buyukcekmece. Ennis was seen down on the floor in immense pain. <strong>TAIWAN JONES</strong> Buffalo Bills running back Taiwan Jones was left bloodied after a play during a game against the Los Angeles Chargers on Sept. 16. Jones recovered a fumble in his team's own end zone and, while he was attempting to <a href=\"https://www.foxnews.com/sports/buffalo-bills-player-taiwan-jones-left-bloodied-after-gruesome-tackle\" target=\"_blank\">scramble away</a> from Chargers players, lost his helmet and was blasted head-on by Uchenna Nwosa. Jones laid on the field motionless for a bit before clutching his head in agony. When trainers were able to get him up, he was sporting a bloodied headband. <strong>CARIS LEVERT</strong> Brooklyn Nets guard Caris Levert <a href=\"https://www.foxnews.com/sports/brooklyn-nets-caris-levert-sustains-severe-leg-injury\" target=\"_blank\">went down with a gruesome leg injury</a> in a game against the Minnesota Timberwolves on Nov. 12. Levert was racing back to block a shot when his leg bent awkwardly upon landing. LeVert spent several minutes on the court attended by medical personnel while the crowd fell silent. Timberwolves players huddled in prayer while Nets players surrounded their injured teammate before he was taken off the court on a stretcher. <strong>TONY MCRAE</strong> Cincinnati Bengals cornerback Tony McRae was carted off the field <a href=\"https://www.foxnews.com/sports/cincinnati-bengals-player-carted-off-field-after-taking-blow-to-head\" target=\"_blank\">after taking a blow</a> to his head in a game against the Cleveland Browns on Nov. 25. McRae suffered the injury in the third quarter when he attempted to defend a Browns player during a punt return. <strong>LIONEL MESSI</strong> Soccer superstar Lionel Messi broke his <a href=\"https://www.foxnews.com/world/lionel-messi-suffers-gruesome-injury-during-barcelona-match\" target=\"_blank\">right forearm while playing</a> for FC Barcelona in a match against Sevilla FC on Oct. 20. Messi was injured as he tried to reclaim the ball when he ran into the back of Sevilla midfielder Franco Vazquez and fell in the 17th minute. Trying to cushion his landing, Messi's right elbow bent badly. He was in visible pain and was treated by team doctors. They wrapped his elbow with bandages and the playmaker tried to continue, but he eventually left the field. <strong>MCKENZIE MILTON</strong> UCF quarterback McKenzie Milton <a href=\"https://www.foxnews.com/sports/ucf-star-quarterback-suffers-gruesome-knee-injury-during-game-undergoes-surgery\" target=\"_blank\">suffered a horrifying</a> injury against South Florida on Nov. 24. Milton was tackled at the end of a short run with just over 12 minutes to play in the first half. He was spotted grabbing his knee after the tackle and trainers rushed over quickly to attend to him. He was taken off the field on a stretcher and was out for the rest of the season. <strong>RAHEEM MOSTERT</strong> The San Francisco 49ers running back suffered a <a href=\"https://www.foxnews.com/sports/gruesome-forearm-injury-sidelines-49ers-running-back-raheem-mostert-in-win\" target=\"_blank\">gruesome right forearm injury</a> in a game against the Oakland Raiders on Nov. 1. Mostert was carrying the ball in the third quarter when he was tripped up on what appeared to be a routine play. Mostert appeared to try to brace himself with his right forearm. However, his arm appeared to twist the wrong way. On the video, you could hear the faint sound of Mostert’s arm snapping. Mostert’s teammates immediately call the training staff over to attend to Mostert, who appears to be writhing in pain. <strong>HARVEY PARK</strong> MMA fighters usually suffer tough injuries while in the cage, but Harvey Park <a href=\"https://www.foxnews.com/sports/mma-fighter-battles-through-bone-popping-injury-to-defeat-opponent-in-bout\" target=\"_blank\">suffered an especially gruesome</a> one during a fight at LFA 53 on Nov. 9. Park had to overcome a brutal finger injury during which a bone popped out of his left hand. He battled through the pain and managed to defeat Leville Simpson via unanimous decision. Park was checked out by doctors several times during the event and managed to somehow get through the three-round fight before being worked on. <strong>ALEX SMITH</strong> Washington Redskins quarterback Alex Smith was <a href=\"https://www.foxnews.com/sports/washington-redskins-qb-alex-smith-carted-off-field-after-gruesome-injury\" target=\"_blank\">lost for the season</a> after he suffered two broken bones in his right leg in a game against the Houston Texans on Nov. 18. Smith's right foot and ankle bent in an awkward direction as J.J. Watt and Kareem Jackson sacked him midway through the third quarter. Smith covered his face with both hands, then a towel as medical personnel check him out. Smith suffered a broken fibula and tibia and also had to battle <a href=\"https://www.foxnews.com/sports/washington-redskins-qb-alex-smith-suffering-from-complications-after-surgery-on-broken-leg-reports-say\" target=\"_blank\">an infection</a> before he was released from the hospital. <strong>VINCENT TROCHECK</strong> Florida Panthers center Vincent Trocheck had <a href=\"https://www.foxnews.com/sports/florida-panthers-vincent-trocheck-leaves-game-on-stretcher-after-gruesome-leg-injury\" target=\"_blank\">to be carried off</a> the ice during a game against the Ottawa Senators on Nov. 19 after suffering a leg injury. Trocheck went down with a right leg injury after he appeared to twist it awkwardly against the boards in the first period. His condition wasn’t immediately clear. Trocheck appeared to go down in pain and couldn’t put any weight on his leg. <strong>KELSEY WINGERT</strong> Atlanta Braves reporter Kelsey Wingert <a href=\"https://www.foxnews.com/sports/braves-reporter-suffers-fractured-eye-socket-after-getting-hit-by-foul-ball\" target=\"_blank\">suffered a fractured eye socket</a> while she was covering a game between the Braves and the Philadelphia Phillies on April 1. Wingert, who covers the team for Fox Sports South, was struck by a foul ball while standing in the camera well. Wingert was “resting comfortably” and was expected to make a full recovery, Fox Sports South said in a statement", "authors": "Ryan Gaydos", "title": "The most gruesome sports injuries of 2018: Bad bends and broken bones"}, "https://www.foxnews.com/world/awful-video-shows-dog-pawing-at-cars-doors-after-being-abandoned-by-owner": {"content": "‘Snoop’ is the kind of loyal friend this man doesn’t deserve. A heartbreaking video has emerged of a dog owner abandoning his pet on the side of a road in England – and now an animal welfare group is hoping the public can track him down. \"The footage has to be seen to be believed, it's just awful,” Natalia Perehovsky, an inspector for the Royal Society for the Prevention of Cruelty to Animals, <a href=\"https://news.sky.com/story/dog-tries-to-follow-owner-after-being-abandoned-at-roadside-11591020\">told Sky News</a>. \"To see the poor dog in such obvious distress, jumping up at the car as it drives away, is just heartbreaking. I can't understand how someone could do this,” she added. The RSPCA says the incident happened Dec. 17 in Stoke-on-Trent. Footage shows one person dropping a dog bed onto a sidewalk then running back to a vehicle that has a “second person in the driver’s seat,” Perehovsky said. The vehicle later speeds off with the Staffordshire bull terrier dog in pursuit. The animal, named ‘Snoop’ by his rescuers, was found lying in the bed. \"It beggars belief that someone could abandon a dog like this at Christmas, but we are so thankful to the kind people who found Snoop sitting sadly in his bed, for taking him to the safety of a vet's straight away,” Perehovsky said.", "authors": "Greg Norman", "title": "'Awful' video shows dog pawing at car's doors after being abandoned by owner"}, "https://www.foxnews.com/us/michigan-officer-uses-patrol-car-to-stop-sleeping-wrong-way-driver": {"content": "Officer Tony Jacob stops driver driving wrong way on US131 in Wyoming, Michigan; officer determined driver appeared to be sleeping. A Michigan police officer was in the right place at the right time Thursday to stop a sleeping driver headed the wrong way down a major highway. The Wyoming Police Department <a href=\"https://fox17online.com/2018/12/20/wrong-way-driver-on-us-131-stopped-by-wyoming-police-before-crash/\" target=\"_blank\">told FOX17</a> that Officer Tony Jacob was driving on U.S. 131 around 2:45 a.m. when he spotted the vehicle. Lt. Eric Wiler told FOX17 that without Jacob's quick actions, the wrong-way vehicle \"most certainly would have hit another vehicle head-on.\" The driver, who reportedly hadn't slept for 40 hours, was cited for reckless driving. Wyoming Police said no one was injured during the incident, and that it should serve as a reminder about the dangers of drowsy driving.", "authors": "Travis Fedschun", "title": "Michigan police officer uses patrol car to stop wrong-way driver"}, "https://www.foxnews.com/politics/battle-of-the-billionaires-brewing-trump-could-meet-his-match-in-2020": {"content": "<source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1470/828/billionaires-2.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1862/1048/billionaires-2.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/640/320/1862/1048/billionaires-2.jpg?ve=1&amp;tl=1?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p class=\"speakable\">Donald Trump is the richest president in U.S. history – but as he gears up for a re-election campaign, the real estate magnate could end up facing off against someone even wealthier. The budding 2020 field of potential challengers includes no fewer than four fellow billionaires. The wealthiest of the pack, by far, is former New York City Mayor Michael Bloomberg. The media mogul and gun control advocate’s net worth is estimated at nearly $52 billion, according to the latest Forbes 400 Richest Americans list. That dwarfs Trump, whose wealth is estimated by Forbes at $3.1 billion (though Trump has claimed his net worth is higher). Bloomberg may be the best-known of the billionaires eyeing a bid – and the most likely to take the plunge, given recent trips to early-voting states and a public switch back to the Democratic Party after years as an independent – but several others have stirred speculation. <strong><a href=\"https://www.foxnews.com/apps-products\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> They include: Hedge fund-manager-turned-environmental-activist Tom Steyer (worth $1.6 billion, says Forbes); former Starbucks CEO Howard Schultz (worth $3.3 billion); and investor and Dallas Mavericks owner Mark Cuban (worth $3.9 billion). It’s unclear if any of them would decide to run. While Cuban reportedly is flirting with a White House bid as a Republican or independent, the other three would be entering a sprawling Democratic field that includes high-profile senators and several former presidential candidates. At least on the Democratic side, their immense wealth could amount to a double-edged sword. Like Trump, they would have the ability to self-finance – which would help not only flood the airwaves with commercials but assert their political independence from special interests. Trump wouldn’t be the only one who could claim he’s not for sale with donors. “What it can do is keep you in the race a lot longer than somebody who’s not able to raise money and it obviously allows you to get your message out, whatever that is,” said Adrienne Elrod, a Democratic strategist who served as senior aide on Hillary Clinton’s 2016 presidential campaign. At the same time, their wealth could become a liability, as they seek the nomination in a party where all the energy is with the progressive wing. “I think it’s an uphill battle for a billionaire in the Democratic Party in a way that is distinct from the Republican Party,” said Neil Sroka, communications director for the progressive group Democracy for America. “It’s not necessarily going to hurt them, but it’s definitely not going to help them.” Sroka noted the “income inequality” issue will be front and center in the Democratic primary. “It’s not as if it’s a cross to bear, but it’s something that they’re going to have to talk about and be forthright with throughout the primary process,” he said. For now, Bloomberg is attracting the most attention among the billionaires. He took a highly visible swipe at the president over the weekend, <a href=\"https://www.bloomberg.com/opinion/articles/2018-12-23/shutdown-stock-slump-and-mattis-exit-cap-grim-year-for-trump\">with a blistering column for his media company decrying</a> Trump's \"recklessly emotional and senselessly chaotic approach to the job.\" A former Republican turned independent who returned to the Democratic Party this year, Bloomberg made stops in the early caucus and primary voting states of Iowa and New Hampshire this past fall, fueling speculation he’s gearing up for a White House run. “He’s done a lot of good in his post-mayoral life with his wealth and he’s espoused a lot of progressive values as part of that,” Elrod said of Bloomberg’s efforts to battle gun violence and his vow to make climate change the defining issue in 2020. But she added that “the biggest thing that’s going to hurt him more than his personal wealth is the fact that he used to be a Republican.” She said that would be a “far bigger liability” competing in “a very left-leaning progressive grassroots primary.” <strong><a href=\"https://www.foxnews.com/politics/2020-democratic-prospects-making-early-moves-in-iowa\">2020 DEM PROSPECTS MAKE EARLY MOVES IN IOWA</a></strong> Steyer, meanwhile, has attracted attention spending millions on a campaign to impeach the president. The former hedge fund manager – who’s said he’ll decide on a White House run early in the new year – kicked off a town hall tour this month in South Carolina, the first southern state to vote in the primary and caucus calendar. That tour will also bring him to New Hampshire, Iowa and Nevada, other early-voting states. Steyer has also built up a vast email distribution list through his “Need to impeach” drive and NextGenAmerica, the grassroots advocacy organization he created five years ago. “When you think of Tom Steyer, the first thing Democratic voters think of is he’s for impeachment, which is not a bad thing, because he’s able to get his message out and break through,” Elrod said. But she questioned whether the impeachment push would actually translate to primary votes. Schultz, who suffers from a lack of name recognition compared with some of the other uber-wealthy potential candidates, has hired a major public relations team and is expected to crisscross the country early in 2019 as he promotes a new book. For any of these businessmen who enter politics, strategists say the message will matter more than the money. “You can bring a lot of big money in, but we just saw in some of our recent elections here that that doesn’t mean at the end of the day that you’re going to be the one with your name on the ballot,” Zandra Rice-Hawkins, executive director of the New Hampshire-based progressive group Granite State Progress, said. Ultimately, a hurdle for these candidates may be whether any of them can represent change in a party torn between the old and new guard, after rallying behind Clinton in 2016 only to see the establishment choice narrowly lose to Trump. “I don’t know that the Democrats are necessarily interested in a candidate like [the billionaires] rather than somebody who is younger or who speaks to questions of diversity or who is going to run a much more unabashedly liberal or progressive campaign,” Saint Anselm College politics professor Christopher Galdieri said.", "title": "Super-rich potential candidates all hinting at bids to topple Trump in 2020"}, "https://www.foxnews.com/us/search-suspended-for-new-jersey-father-son-after-small-plane-crashes-on-trip-back-from-disney": {"content": "A search for a small plane carrying a father and son from New Jersey was suspended Sunday, three days after the aircraft crashed off the Florida coast during a return trip from their Disney vacation, officials said. The U.S. Coast Guard <a href=\"https://content.govdelivery.com/accounts/USDHSCG/bulletins/2242aa7\" target=\"_blank\">said in a news release</a> that a search operation off Jacksonville was called off after aircraft and two Coast Guard cutters searched 1,400 square miles for 56 hours. “The suspension of an active search and rescue case is never an easy decision to make,” Christopher Eddy, search and rescue mission coordinator for the Coast Guard 7th district, said in a statement. “We always want the best case scenario to happen and will continue to monitor for new information that could aid responders.” <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> The Piper PA-46 Malibu was en route from Orlando to New Jersey when it crashed about 18 miles off the coast of Jacksonville on Thursday shortly after 9 a.m. While the identities of those on board the plane have not yet been released by officials, an attorney for the family of Peter Renzulli <a href=\"https://www.nj.com/news/2018/12/search-ends-for-missing-nj-bound-plane-in-florida.html\" target=\"_blank\">told NJ.com</a> the 51-year-old and his 18-year-old son, Daniel, were on the aircraft at the time coming back from a Disney vacation. “The family was devastated to learn that the aircraft could not be located,” Justin Marchetta told NJ.com. “Peter and Daniel are accomplished pilots and their disappearance is heartbreaking.\" Marchetta told the news outlet that Renzulli had recently completed 30 hours of advanced instruction in the Piper. “We ask that the privacy of the Renzulli family be respected at this difficult time,” he said. The Coast Guard said it had deployed two cutters and several response boats in addition to MH-65 Dolphin helicopters and an HC-144 Ocean Sentry aircraft from the Coast Guard Air Station in Miami.", "authors": "Travis Fedschun", "title": "Search suspended for father, son after plane crashes on trip back from Disney"}, "https://www.foxnews.com/politics/chief-justice-roberts-weighs-in-on-mystery-subpoena-clash": {"content": "Supreme Court Chief Justice John Roberts has weighed in on a clash over a mysterious grand jury subpoena, which is rumored to be connected to Special Counsel Robert Mueller's probe. The dispute involves an unknown company owned by a foreign nation, which has fought the subpoena and appealed a related contempt citation. In a brief order issued Sunday, Roberts stayed that contempt citation and associated financial penalties pending a response from government lawyers, due Dec. 31. While the substance of the clash between prosecutors and the company remains unclear, <a href=\"https://www.politico.com/story/2018/12/23/roberts-mueller-subpoena-justice-1074810\">Politico reported the dispute</a> seems to involve Mueller’s team. A Politico reporter in October overheard a person connected to the appeal request a copy of the special counsel’s latest filing in the case from the D.C. Circuit Court of Appeals clerk’s office. When the case was heard earlier this month, the courtroom reportedly was closed to the public and journalists were ordered to leave the floor where lawyers were presenting their positions. <strong><a href=\"https://www.foxnews.com/apps-products\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> There is scant information in the public docket about the case, but a three-judge D.C. Circuit panel examining the <a href=\"https://www.politico.com/story/2018/12/18/mueller-probe-legal-foreign-owned-company-1068725\">appeal revealed the witness</a> fighting the subpoena is a corporation owned by a foreign state, Politico reported. The panel went on to reject the company’s argument that it is immune from grand jury subpoenas and that complying would violate the law in the company’s home country. Mueller’s team has not publicly commented on the dispute, while lawyers for President Trump said the case does not involve the president. “We’re not involved in it — we’re not aware of the nature or scope of the litigation,” Jay Sekulow, one of the president’s lawyers, <a href=\"https://www.nytimes.com/2018/12/15/us/politics/special-counsel-subpoena.html\">told The New York Times</a>. Aside from what may be happening behind closed doors, Mueller's investigation has publicly moved at a rapid clip in the closing weeks of the year, with the sentencing of former Trump attorney Michael Cohen in connection with two federal cases and a contentious hearing last week for <a href=\"https://www.foxnews.com/politics/former-national-security-adviser-michael-flynn-sentenced\">ex-national security adviser Michael Flynn</a> -- whose sentencing will drag into 2019. <em>Fox News' Bill Mears contributed to this report. </em>", "authors": "Andrew O'Reilly", "title": "Chief Justice Roberts weighs in on mystery subpoena clash potentially tied to Mueller"}, "https://www.foxnews.com/world/netanyahu-calls-early-israel-election-for-april-in-bid-for-fourth-straight-term": {"content": "<span class=\"dateline\">JERUSALEM – </span>Prime Minister Benjamin Netanyahu on Monday called early elections for April, setting the stage for a three-month campaign clouded by a series of corruption investigations against the long-serving Israeli leader. Riding high in the polls, Netanyahu appears all but certain to win a fourth consecutive term and a place in history as the country's longest-serving prime minister. Those bright prospects, however, could be derailed by a looming decision by the country's attorney general on whether to file charges against Netanyahu. Netanyahu, facing the possibility of bribery and breach of trust charges in three different cases, made scant mention of these investigations at a gathering of his Likud Party as he announced plans for what is expected to be an April 9 vote. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Appearing loose and confident, he listed his government's accomplishments in office and said he hoped his current religious, nationalistic coalition would be the \"core\" of Israel's next government as well. \"We will ask the voters for a clear mandate to continue leading the state of Israel our way,\" he said to applause from party members. Netanyahu, who also served a term in the late 1990s, has been prime minister for the past decade. His supporters point to a humming, high-tech economy, his handling of security issues, particularly countering the threat of Iranian influence in the region, and his gains on the diplomatic stage, including a close alliance with President Donald Trump that has paid important dividends. Pete Hegseth talks with Israeli Prime Minister Benjamin Netahyahu. Trump's recognition of Jerusalem as Israel's capital and his withdrawal from the international nuclear deal were both welcomed by Netanyahu. The Israeli leader also has quietly forged ties with Sunni Arab states, further sidelining the Palestinians, who have severed ties with the U.S. because they believe Trump is biased against them. The White House still has not released a long-awaited peace plan, and Monday's announcement could further delay its release. But critics say these gains have come at a deep price to Israel's democratic ideals. Netanyahu's hard-line government has promoted a series of laws that critics say are aimed at muzzling liberal critics and sidelining the minority Arab population. They point to wide gaps between rich and poor and high cost of living, and say that by neglecting the Palestinian issue and continuing to build settlements in the West Bank, the country is on the path to becoming an apartheid-like binational state. Former Prime Minister Ehud Barak called the election \"the most fateful\" since the assassination of then-Prime Minister Yitzhak Rabin in 1995. \"If we all act properly, on April 10 we will part with Netanyahu,\" he said on Hahadashot TV. \"The state of Israel will get on a different path instead of this nationalist, racist, dark vision.\" Israeli Prime Minister Benjamin Netanyahu's son temporarily blocked from Facebook after a post criticizing the social media platform for removing a post in which he called on Muslims to leave Israel. Barak called for the country's dovish and centrist parties to band together in a unified \"bloc\" in a bid to topple Likud. Yair Lapid, leader of the centrist Yesh Atid party, said the election was a battle for the \"soul of the country.\" For now, there does not appear to be anyone with the popularity or gravitas to topple Netanyahu. One wild card is Benny Gantz, a popular former military chief who is flirting with the idea of entering politics. Opposition parties have been aggressively courting Gantz. But for now, he has not committed to joining any party. Instead, the biggest threat appears to be posed by Attorney General Avichai Mandelblit, who must soon decide on whether to indict the prime minister. Earlier this month, police recommended that Netanyahu be charged with bribery for promoting regulatory changes worth hundreds of millions of dollars to the country's main telecom company Bezeq. In exchange, they believe Netanyahu used his connections with Bezeq's controlling shareholder to receive positive press coverage on the company's popular news site. Police have also recommended indicting Netanyahu on corruption charges in two other cases. One involves accepting gifts from billionaire friends, and the second revolves around alleged offers of advantageous legislation for a major newspaper in return for favorable press coverage. Arrests come after two deadly shootings are blamed on the terror group; Trey Yingst report from the West Bank on the week of heavy violence. Netanyahu has denied any wrongdoing and said he is the victim of a media-fueled witch hunt. At Monday's Likud meeting, Netanyahu brushed off a reporter's question and said he expected the investigations to lead nowhere. Mandelblit has not said when he expects to make a decision. The Justice Ministry announced Monday that deliberations were continuing and were \"not dependent on political events.\" Israeli law is unclear about whether a sitting prime minister must resign if charged with a crime, and Netanyahu has hinted that he will remain in office to fight any indictment. But criminal charges, and the distraction of a protracted legal battle, could fuel calls for him to step aside. Finance Minister Moshe Kahlan, a key ally, said Monday that a prime minister \"cannot serve\" if he is indicted following a required hearing. Reuven Hazan, a political scientist at Israel's Hebrew University, said the campaign would be dominated by \"a discussion of whether Netanyahu should stay after, if he is prosecuted.\" He said Netanyahu had settled on the April election, roughly seven months ahead of schedule, in part to \"pre-empt\" an indictment. The thinking is that it would be politically difficult for Mandelblit to indict, and potentially topple, a popular, newly re-elected prime minister. \"He wants to turn around to the attorney general and say `before you decide to prosecute me pay attention. The people of Israel have re-elected me for a fourth time,\"' Hazan explained. An electoral victory would send a message that \"you cannot overturn the results of a democratic election,\" he said. Palestinian militant groups announce they've agreed to a cease-fire with Israel to stop the heaviest fighting between them in years; Benjamin Hall reports from Sderot, Israel. Netanyahu's coalition has been roiled by internal divisions for months. Avigdor Lieberman, leader of a small, ultranationalist party, resigned as defense minister last month to protest what he perceived to be the government's weak response to rocket attacks from Hamas-ruled Gaza. That left Netanyahu with a fragile majority of just 61 seats in the 120-seat parliament. But a new bill extending the military draft to Jewish ultra-Orthodox men appeared to be the final trigger for the government's downfall. Ultra-Orthodox parties consider conscription a taboo. As a deadline for the legislation loomed, his religious coalition partners were demanding the legislation be weakened. Earlier Monday, Lapid, a harsh critic of the religious parties, said he was rescinding his support for the draft bill, saying the planned compromise essentially rewarded draft dodgers. As a result, Netanyahu convened his fellow coalition faction leaders and the decision was made to dissolve parliament and go to elections.", "title": "Netanyahu calls early Israel election for April in bid for fourth straight term"}, "http://insider.foxnews.com/2018/12/24/paralyzed-army-veteran-gifted-mortgage-free-smart-home-christmas": {"content": "An Army veteran and Purple Heart recipient received a new home for Christmas that was built to accommodate his wartime injuries. Former combat medic Travis Worrell received the mortgage-free home thanks to the <a href=\"https://tunnel2towers.org/tunnel-to-towers-delivers-smart-home-to-veteran-for-christmas/\" target=\"_blank\">Tunnel to Towers Foundation</a>, founded by Frank Siller. Worrell is a quadriplegic who was paralyzed after sustaining injuries in Afghanistan in 2012, according to the organization. The foundation was started after Siller's brother, Stephen, died while trying to save others during the terror attack on Sept. 11, 2001. <a href=\"/2018/12/23/greg-gutfeld-show-introduces-pc-santa\"><strong>WATCH: Greg Gutfeld Show Introduces Gluten-Free, Eco-Friendly 'P.C. Santa'</strong></a> He said Monday on <a href=\"/show/americas-newsroom\">America's Newsroom</a> that the home will give a lot of Worrell's independence back to him. \"There's so many others out there that need these type of homes that are specially adapted for their injuries,\" he added. According to Tunnel to Towers, Worrell's new home in Texas features \"wide doorways and walkways allowing him to move about the home freely in his wheelchair.\" Siller also said Monday that his organization now builds homes for Gold Star families. Watch more above. <strong><a href=\"/2018/12/24/ronald-reagans-son-warns-trump-he-has-no-choice-build-border-wall\">'It's Now or Never': Reagan's Son Warns President Trump He Has 'No Choice' But to Build Border Wall</a></strong> <strong><a href=\"/2018/12/24/new-jersey-boy-has-christmas-wish-bringing-army-dad-home-granted\">NJ Boy's Christmas Wish of Bringing Army Dad Home Granted With Surprise School Assembly</a></strong> <strong><a href=\"/2018/12/24/michael-bloomberg-blasts-donald-trump-new-op-ed-calls-his-presidency-terrible\">'Recklessly Emotional': Bloomberg Slams Trump in Op-Ed, Calls His Presidency 'Terrible'</a></strong>", "title": "Paralyzed army veteran gifted mortgage-free 'smart home' for Christmas"}, "https://www.foxnews.com/opinion/stuart-varney-would-the-beauty-of-silent-night-be-too-much-to-ask-for-instead-of-secular-christmas-music": {"content": "<source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1470/828/MY_TAKE_VARNEY_ENDFRAME.png?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1862/1048/MY_TAKE_VARNEY_ENDFRAME.png?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/640/320/1862/1048/MY_TAKE_VARNEY_ENDFRAME.png?ve=1&amp;tl=1?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p class=\"speakable\">There was no little drummer boy in the manger. No rup-per-pum-pum.  And I'm not keen on that kind of secular music at Christmas. At least not the amount and volume to which we are subjected. <strong><a href=\"https://nation.foxnews.com/?cmpid=org=NAT::ag=fn::mc=referral::src=FNC_web::cmp=content::add=opinion\" target=\"_blank\">CLICK HERE TO SIGN UP FOR FOX NATION.</a></strong> Remember Musak? Maybe it’s still around. It was the music that was played in elevators when elevators first had sound coming at you. Tacky in the extreme. <a href=\"https://www.foxnews.com/category/special/occasions/christmas\" target=\"_blank\">CLICK HERE FOR MORE OF OUR CHRISTMAS COVERAGE.</a> It’s the same now with so-called \"Christmas music.\" Department stores, malls, elevators and office building lobbies. Always secular. “Jingle Bells.” “Rudolph the Red-Nosed Reindeer.” All very pleasant, but always there. Right after Thanksgiving, sometimes before, you are hit with the forced jollity of Burl Ives... Ho ho ho. Would it be too much to ask for the beauty of “Silent Night? Or the rousing \"Hark, the Herald Angels Sing\"... Perhaps the “Hallelujah Chorus” would be going too far, but you get the point. I don't want the Christian message of Christmas, driven from the public square. \"Jingle Bells\" is cute but inspires no joy. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP.</a></strong> Am I a Grinch? <a href=\"https://nation.foxnews.com/\" target=\"_blank\">You can watch \"My Take with Stuart Varney\" exclusively on Fox Nation. Sign up for your free trial now.</a> <em>Adapted from Stuart Varney’s monologue on Fox Nations’ “My Take with Stuart Varney.”</em>", "authors": "Stuart Varney", "title": "VARNEY: Would the beauty of 'Silent Night' be too much to ask for?"}, "https://www.foxnews.com/politics/mattis-sends-last-christmas-message-to-troops-before-resigning": {"content": " Outgoing Defense Secretary James Mattis wished a Merry Christmas \"to all you lads and lasses holding the line in 2018\" in one of his final messages to America's troops before his departure from the Trump administration. \"Since Washington crossed the Delaware at Christmas in 1776, American troops have missed holidays at home to defend our experiment in democracy,\" Mattis said in the 20-second video message. \"To all you lads and lasses holding the line in 2018, on land, at sea, or in the air, thanks for keeping the faith. \"Merry Christmas and may God hold you safe,\" Mattis concluded. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> The video was recorded Dec. 19, one day before Mattis submitted his resignation letter to Trump. On Sunday, Trump announced that Mattis would be leaving the Pentagon on Jan. 1, two months earlier than planned. Mattis resigned in protest of Trump's decision to pull all U.S. troops out of Syria. On Sunday, Fox News confirmed that Mattis had signed the official withdrawal orders, though Pentagon officials refused to discuss the specific timeline due to operational security. Roughly 2,000 American troops are currently in Syria. Officials have told Fox News the U.S. has no plans to withdraw the more than 5,000 American troops in neighboring Iraq. Some of those special operations forces could be used for raids against “high value targets” in Syria from bases in Iraq if necessary, officials said. <em>Fox News' Lucas Tomlinson and The Associated Press contributed to this report.</em>", "authors": "Samuel Chamberlain", "title": "Mattis sends last Christmas message to troops before resigning"}, "https://www.foxbusiness.com/markets/dow-plunges-650-points-in-worst-christmas-eve-trading-session-ever": {}, "https://www.foxnews.com/world/japan-rolling-out-new-support-measures-to-curb-acceleration-of-population-collapse": {"content": "The acceleration of Japan’s population collapse is so rapid that the country’s birthrate has dropped to a historic level, the lowest since data gathering began in 1899, according to reports. <a href=\"https://www.japantimes.co.jp/news/2018/12/21/national/number-babies-born-japan-2018-lowest-since-records-began-population-decline-highest/#.XB0GwktKiUm\">The Japan Times</a> reported that its government believes that 921,000 babies will be born by the end of 2018 — 25,000 fewer than in the previous year. The country’s birth and death rates are creating huge social and economic concerns, as <a href=\"https://www.npr.org/2018/12/21/679103541/japans-population-is-in-rapid-decline\">NPR </a>reported. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> About 127 million people live in Japan, and its population could drop below 100 million by 2049. By 2036, one in three people will be elderly, creating workforce concerns. <a href=\"https://www.theatlantic.com/business/archive/2017/07/japan-mystery-low-birth-rate/534291/\">The Atlantic</a> reported that a major factor may be that labor laws were changed in the 1990s leading to more freelance work rather than stable jobs for workers — building “a class of men who don’t marry and have children because they — and their potential partners — know they can’t afford to.” Reports have said among Japanese singles between the ages of 18 and 34, nearly 70 percent of men and 60 percent of women were not in a relationship. The country’s social security system is being redeveloped on the premise that aging and a shrinking population will continue. In September, Foreign Minister Taro Kono said Japan is gearing up to accept more foreign workers as its own population is on the brink of a steep decline. Kono told a World Economic Forum meeting in Hanoi that Japan gains “value added” by accepting foreigners, especially since its aging population and low birth rate mean the country is shrinking by a half-million people a year. “We cannot sustain our society like that,” he said in response to a question during a panel discussion. “We are opening up our country. We are opening up our labor market to foreign countries. We are now trying to come up with a new work permit policy so I think everyone shall be welcome in Japan if they are willing to assimilate into Japanese society.” <em>The Associated Press contributed to this report.</em>", "authors": "Frank Miles", "title": "Japan tries to curb its plummeting population"}, "https://www.foxnews.com/world/pope-forgo-greed-and-gluttony-of-christmas-for-simple-love": {"content": "<span>Pope Francis kisses a statue of Baby Jesus as he celebrates the Christmas Eve Mass in St. Peter's Basilica at the Vatican, Monday, Dec. 24, 2018. (AP Photo/Alessandra Tarantino)</span><!-- --> <span>Pope Francis delivers his message as he celebrates the Christmas Eve Mass in St. Peter's Basilica at the Vatican, Monday, Dec. 24, 2018. (AP Photo/Alessandra Tarantino)</span><!-- --> <span class=\"dateline\">VATICAN CITY – </span>Pope Francis urged Christians on Monday to forgo the greed, gluttony and materialism of Christmas and to focus instead on its message of simplicity, charity and love. Francis celebrated a Christmas Eve Mass in St. Peter's Basilica, opening a busy week for the pope that includes a Christmas Day message and blessing, a Dec. 26 prayer, New Year's Eve vespers and a Jan. 1 Mass. During his homily Monday, Francis lamented that many people find their life's meaning in possessions when the biblical story of Christ's birth emphasizes that God appeared to people who were poor when it came to earthly possessions, but faithful. \"Standing before the manger, we understand that the food of life is not material riches but love, not gluttony but charity, not ostentation but simplicity,\" Francis said, dressed in simple white vestments. \"An insatiable greed marks all human history, even today, when paradoxically a few dine luxuriantly while all too many go without the daily bread needed to survive,\" he said. Francis has focused on the world's poor and downtrodden, its refugees and marginalized, during his five-year papacy. The Catholic Church's first pope from Latin American instructed the Vatican to better care for the homeless around Rome, opening a barber shop, shower and medical clinic for them in the embracing colonnade of St. Peter's Square. To extend his outreach this Christmas, Francis sent his trusted secretary of state, Cardinal Pietro Parolin, to Iraq to celebrate with the country's long-suffering Christians. Catholics are among the religious minorities targeted for Islamic State-inspired violence that has driven tens of thousands from their homes. Parolin met Monday in Baghdad with Iraqi Prime Minister Adel Abdul-Mahdi. He is scheduled in the coming days to travel to northern Iraq to meet with Kurdish leaders in Irbil and to celebrate Mass in Qaraqosh in the Nineveh plains, near Mosul, according to the Vatican. The Vatican has for years expressed concern about the exodus of Christians from communities that have existed since the time of Jesus, and urged them to return when security conditions permit. Francis is likely to refer to the plight of Christians in Iraq and Syria during his Christmas Day \"Urbi et Orbi\" (To the city and the world) speech. He is scheduled to deliver it Tuesday from the loggia of St. Peter's and again at Mass on New Year's Day, which the church marks as its world day for peace.", "title": "Pope: Forgo greed and gluttony of Christmas for simple love"}, "http://insider.foxnews.com/2018/12/24/dan-bongino-rips-bob-corker-over-really-gross-shot-president-donald-trump": {"content": "Dan Bongino slammed Tennessee Sen. Bob Corker Monday on \"Fox &amp; Friends\" after he <a href=\"https://www.foxnews.com/politics/corker-calls-govt-shutdown-made-up-fight-so-trump-can-look-like-hes-fighting-and-winning\" target=\"_blank\">took a shot at President Trump</a> over the weekend. Corker has increasingly criticized the president since the Republican senator announced he wouldn't run for a third term. In an interview Sunday, Corker said that Trump's fight for a border wall, which led to a partial government shutdown, was \"made up.\" \"This is a made-up fight so the president can look like he's fighting,\" he said. \"But even if he wins, our borders are gonna be insecure.\" <strong><a href=\"/2018/12/24/michael-bloomberg-blasts-donald-trump-new-op-ed-calls-his-presidency-terrible\">'Recklessly Emotional': Bloomberg Slams Trump in Op-Ed, Calls His Presidency 'Terrible'</a></strong> Bongino called Corker's comments \"gross\" on Monday and backed Trump's calls for stronger border enforcement. \"For him to abandon the president right now is really gross and shows he has no spine, and I'm glad he left office,\" Bongino, a former Secret Service agent, said. During Sunday's interview, Corker urged the American public to focus on a \"significant thing like pulling out of Syria.\" Trump criticized the senator on Twitter following his remarks, noting that he refused to endorse him. .....Bob Corker was responsible for giving us the horrible Iran Nuclear Deal, which I ended, yet he badmouths me for wanting to bring our young people safely back home. Bob wanted to run and asked for my endorsement. I said NO and the game was over. <a href=\"https://twitter.com/hashtag/MAGA?src=hash&amp;ref_src=twsrc%5Etfw\">#MAGA</a> I LOVE TENNESSEE! — Donald J. Trump (@realDonaldTrump) <a href=\"https://twitter.com/realDonaldTrump/status/1076935567760338944?ref_src=twsrc%5Etfw\">December 23, 2018</a> Bongino added on Monday that Democrats \"don't want to give Donald Trump a victory,\" which is why they won't compromise on border security. \"They are focused on one thing and one thing only: that's impeachment or a devastating loss for him in re-election,\" he said. Watch more of Dan Bongino's interview from \"Fox &amp; Friends\" above. <strong><a href=\"/2018/12/24/ronald-reagans-son-warns-trump-he-has-no-choice-build-border-wall\">'It's Now or Never': Reagan's Son Warns President Trump He Has 'No Choice' But to Build Border Wall</a></strong> <strong><a href=\"/2018/12/24/new-jersey-boy-has-christmas-wish-bringing-army-dad-home-granted\">NJ Boy's Christmas Wish of Bringing Army Dad Home Granted With Surprise School Assembly</a></strong> <strong><a href=\"/2018/12/23/greg-gutfeld-show-introduces-pc-santa\">WATCH: Greg Gutfeld Show Introduces Gluten-Free, Eco-Friendly 'P.C. Santa'</a></strong>", "title": "'He has no spine': Bongino rips GOP Sen. Corker over 'really gross' shot at Trump"}, "https://www.foxnews.com/world/north-korea-must-pay-501-million-to-otto-warmbiers-parents-judge-rules": {"content": " An American judge has ruled that Kim Jong Un’s North Korean regime must pay $501 million to the parents of Otto Warmbier after their son died following his time spent in captivity there. The ruling Monday in the U.S. District Court for the District of Columbia is largely symbolic, though, as it is unlikely North Korea hands over any cash. It comes after Warmbier’s parents sued the Hermit Kingdom for more than $1 billion. “North Korea is liable for the torture, hostage taking, and extrajudicial killing of Otto Warmbier, and the injuries to his mother and father, Fred and Cindy Warmbier,” Chief Judge Beryl A. Howell <a href=\"https://www.documentcloud.org/documents/5667561-Memorandum-Opinion.html\">wrote in the ruling</a>. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> The college student from Ohio was on a tour in North Korea when he allegedly stole a propaganda sign from a hotel. He was arrested in January 2016 and held captive for more than 17 months. Warmbier died from severe brain damage after he was repatriated to the U.S. in June 2017. He was 22. North Korea has <a href=\"https://www.foxnews.com/world/otto-warmbier-dead-former-us-prisoner-of-north-korea-was-22\">repeatedly denied accusations</a> Warmbier was tortured and officials told their U.S. counterparts at the time that he had suffered from botulism and then slipped into a coma after taking a sleeping pill. But doctors in Cincinnati said their examination showed no evidence of botulism, the strong neurotoxin produced by a bacterium. <a href=\"https://www.foxnews.com/opinion/cia-shatters-a-glass-ceiling-with-the-appointment-of-a-woman-to-lead-its-clandestine-arm\"><strong>OPINION: CIA SHATTERS GLASS CEILING WITH THIS APPOINTMENT</strong></a> “When Otto returned to Cincinnati late on June 13th he was unable to speak, unable to see and unable to react to verbal commands. He looked very uncomfortable -- almost anguished,” his parents had said in a statement. “Although we would never hear his voice again, within a day the countenance of his face changed -- he was at peace.  He was home and we believe he could sense that. They added: “We thank everyone around the world who has kept him and our family in their thoughts and prayers. We are at peace and at home too.\" <em>Fox News’ Paulina Dedaj and the Associated Press contributed to this report.</em>", "authors": "Greg Norman", "title": "North Korea must give $501 million to Otto Warmbier’s parents, judge rules"}, "https://www.foxnews.com/politics/maine-gop-congressman-ends-legal-challenge-to-democrats-victory": {"content": "U.S. Rep. Bruce Poliquin, R-Maine, announced Monday that he was ending his legal challenge to the election of his Democratic opponent under the state's new ranked-choice voting system. In a statement posted to Facebook, Poliquin wrote that \"despite winning the largest number of votes on Election Day, I believe it's in the best interest of my constituents and all Maine citizens to close this confusing and unfair chapter of voting history by ending any further legal proceedings.\" \"I’ve done everything possible to protect the one-person, one-vote Constitutional right of my fellow Mainers,\" Poliquin added. \"For over 100 years in our State’s history, the candidate who received the most votes won. Elections here have always been straightforward and non-controversial.\" <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Poliquin's defeat by Jared Golden means that all 12 representatives for the six New England states are Democrats. Democrats will have at least 235 seats in the new House of Representatives next year with the outcome of a contested race in North Carolina still pending. Poliquin also said that he wished Golden the best during the coming term. Golden said in a statement that he looked forward to getting to work and thanked Poliquin for his service to the state and \"the spirited campaign he ran in 2018.\" Poliquin received approximately 2,000 more first-place votes than Golden on Election Day, only for Golden to surge ahead once second preferences from ballots supporting two other independent candidates were re-allocated.  The two-term incumbent argued that the system was unconstitutional and requested that the courts either declare him the winner or order another election be held. Earlier this month, U.S. District Judge Lance Walker said critics could question the wisdom of ranked-choice voting, but such criticism \"falls short of constitutional impropriety.\" Poliquin also lost a last-ditch bid to challenge Golden's scheduled Jan. 3 swearing-in by asking the courts to halt the certification of election results. <strong><a href=\"https://www.foxnews.com/politics/ranked-choice-voting-litmus-test-in-maine-could-pave-way-for-other-states\">RANKED</a></strong><strong><a href=\"https://www.foxnews.com/politics/ranked-choice-voting-litmus-test-in-maine-could-pave-way-for-other-states\"> CHOICE VOTING LITMUS TEST IN MAINE COULD PAVE WAY FOR OTHER STATES</a></strong> Maine became the first state to allow voters to rank candidates on the ballots in a congressional race. Maine's top state court last year warned that ranked-choice voting conflicts with the state's constitution, which says the winners of state-level races are whoever gets the most votes, or a \"plurality.\" So Maine uses ranked-choice voting only in federal elections and state primary races, but not for general elections for governor or the Legislature. Democratic Gov.-elect Janet Mills has vowed to seek to amend the state constitution so the system can be used in all elections. <em>The Associated Press contributed to this report.</em>", "authors": "Samuel Chamberlain", "title": "Maine GOP congressman ends legal challenge to Democrat's victory"}, "https://www.foxnews.com/us/connecticut-teen-arrested-in-murder-of-12-year-old-boy": {"content": "<span class=\"dateline\">BRIDGEPORT, Conn. – </span>A teen is facing murder charges stemming from the fatal drive-by shooting of a 12-year-old Connecticut boy killed outside his home. Bridgeport Police Chief Armando Perez confirmed Monday to the Connecticut Post that 18-year-old Tajay Chambers has been charged with murder with special circumstances, carrying a pistol without a permit, second-degree larceny and risk of injury to a child. Perez says three juveniles will also be charged in connection with the Dec. 18 shooting of Clinton Howell, described as a bystander. Chambers has been in custody since Dec. 19 for an October alleged assault. A judge held him on $500,000 bond. ICE placed a detainer on Chambers, who authorities say is a Jamaican immigrant without legal status. He's scheduled to appear Wednesday in court. It's not clear if he has a lawyer.", "title": "Connecticut teen arrested in murder of 12-year-old boy"}, "https://www.foxnews.com/sports/wrestlers-attorney-suggests-haircut-because-of-referees-tardiness": {"content": "A lawyer for a high school wrestler whose dreadlocks were cut off after a referee told him to lose the hairstyle or forfeit minutes before his match is suggesting the impromptu hair cut was due in part to the referee’s tardiness. <a href=\"https://www.foxnews.com/sports/new-jersey-referee-who-forced-wrestler-to-cut-dreadlocks-before-match-is-under-investigation\">Buena Regional High School wrestler Andrew Johnson, who is black, had a cover over his hair</a>, but referee Alan Maloney, who is white, said that wouldn’t do. Johnson won Wednesday’s match but appeared visibly distraught. Dominic Speziali issued a statement Monday in which Andrew Johnson’s parents said Maloney didn’t attend the weigh-in that day. They also say that when Maloney evaluated the teen before the match, he didn’t raise any issues with the length of his hair or the need to wear a head covering. Maloney didn’t respond to a request for comment Monday. The organization that oversees the state’s high school athletics announced Saturday that he won’t be assigned to any matches until the incident is reviewed. Michael Cherenson, spokesman for the New Jersey State Interscholastic Athletic Association, said the organization had reached out to groups that assign referees “and they’ve all agreed” not to assign Alan Maloney to any event until further notice An SNJ Today reporter tweeted a video of Johnson getting his hair cut. The video was shared widely on social media, with users calling the incident “racist,” ‘‘cruel” and “humiliating.” In the statement issued Monday, Johnson’s parents also thanked those who have shown support for their son. “Andrew has been deeply moved by the thunderous outpouring of unsolicited support — including from an Olympic wrestler, leading civil rights advocates and elected officials — after the shocking pre-match ultimatum,” the statement said. “Wrestling has taught Andrew to be resilient in the face of adversity. As we move forward, we are comforted by both the strength of Andrew’s character and the support he’s received from the community. We will do all that we can to make sure that no student-athlete is forced to endure what Andrew experienced.”", "title": "Wrestler’s attorney suggests haircut because of referee’s tardiness"}, "https://www.foxnews.com/entertainment/see-teenage-meghan-markle-belt-out-santa-baby-at-high-school-christmas-show": {"content": "Royal Wedding: A recap of the nuptials from the famous guests, the incredible fashion, the grand processions, the vows, and the speech by Bishop Michael Curry, to the incredible kiss between newlyweds Meghan Markle and Prince Harry. Before she was the Duchess of Sussex spending Christmas at Sandringham with the Queen, she was a \"Suits\" star. Before \"Suits,\" Meghan Markle sang \"Santa Baby\" at her high school Christmas show. Footage recently <a href=\"https://www.dailymail.co.uk/news/article-6526751/Meghan-Markle-sings-heart-Santa-Baby-newly-uncovered-footage.html\" target=\"_blank\">unearthed by The Daily Mail</a> shows Markle mugging for the camera while singing the cheeky Christmas classic with her pal, Natalie Garcia Fryman, who would also go on to become an actress on shows like \"Lost\" and \"Hawaii Five-O.\" The footage was from the December 1998 Immaculate Heart High School Christmas show in Markle's hometown of Los Angeles. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Markle, now 37, was a senior in high school at the time. An audience member <a href=\"https://www.dailymail.co.uk/news/article-6526751/Meghan-Markle-sings-heart-Santa-Baby-newly-uncovered-footage.html\" target=\"_blank\">told The Daily Mail</a>, \"After being a bit of an awkward teen, by this point Meghan has blossomed into an attractive young woman and this show that she was really relishing it. The performance went down really well. The lyrics are quite amusing to think about now.\" Those lyrics, of course, include requests for diamonds and a convertible, as well as other pricey presents — all of which she's now acquired courtesy of her royal status (and, by extension, British taxpayers).", "authors": "Jessica Sager", "title": "See teenage Markle belt out 'Santa Baby' at high school Christmas show"}, "https://www.foxnews.com/entertainment/nypd-lapd-exchange-die-hard-christmas-greetings": {"content": " The seemingly eternal debate over 1980s action film “Die Hard” and its merits as a Christmas movie ensnared both the New York and Los Angeles police departments Monday. “On this Christmas Eve, we’d like to acknowledge our partners at @LAPDHQ who have been working with us to protect Christmas since Hans Gruber’s 1988 attack on Nakatomi Plaza,” New York police tweeted. They concluded their post with a hashtag declaring “YesItsAChristmasMovie.” It didn't take long for police on the West Coast to reply. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> \"On this Christmas Eve, we too would like to acknowledge our partners at @NYPDnews for their continued partnership-they’ll always be more than welcome to follow in McClane’s footsteps &amp; come to the (better) coast &amp; have a party. Yippie Ki Yay &amp; ho ho ho,\" the department tweeted alongside the same hashtag. The 1988 movie, starring Bruce Willis as NYPD Detective John McClane, has sparked <a href=\"http://video.foxnews.com/v/5809832988001/?#sp=show-clips\">conversations</a> about whether the Christmas Eve-set film qualifies for the holiday genre. In the film, McClane visits his wife at a holiday party at a business where she works in Los Angeles. The festivities are soon cut short, however, when a group of terrorists, led by Alan Rickman’s Hans Gruber, takes command of the high-rise building. McClane is then forced to save hostages and take revenge on the terrorists. The film earned positive reviews and spawned multiple sequels. A <a href=\"https://www.foxnews.com/entertainment/die-hard-6-title-and-plot-details-revealed-including-bruce-willis-involvement\">sixth entry in the series</a> is currently in the works.", "authors": "Matt Richardson", "title": "NYPD, LAPD exchange 'Die Hard' Christmas greetings"}, "https://www.foxnews.com/politics/all-alone-trump-prods-dems-to-deal-on-border-wall-as-partial-shutdown-drags-on": {"content": "Former assistant secretary of state for President George W. Bush weighs in on the partial government shutdown. With no compromise in sight to end the partial government shutdown, President Trump on Monday urged Democratic leaders to \"make a deal\" on border security -- while those lawmakers countered that mixed messages from the White House are \"making it impossible to know where they stand.\" The back-and-forth on Christmas Eve signaled a stalemate likely to last through the holiday week and possibly into the new year. Trump, on a busy day of tweeting, weighed in with a social media appeal claiming he's \"all alone\" waiting for Democrats to return to the negotiating table. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> “I am all alone (poor me) in the White House waiting for the Democrats to come back and make a deal on desperately needed Border Security,” Trump tweeted. “At some point the Democrats not wanting to make a deal will cost our Country more money than the Border Wall we are all talking about. Crazy!” The partial government shutdown was triggered Friday at midnight, as funding lapsed for numerous agencies without a deal between the White House and Congress on Trump's request for money to build a U.S.-Mexico border wall. While both sides are trading offers to end the stalemate, they remain far apart, and a top White House official warned the shutdown could stretch into January. But there could be some movement. Acting White House chief of staff Mick Mulvaney, who is also the budget director, said he was waiting to hear from Senate Democratic leader Chuck Schumer about a counteroffer the White House presented Schumer over the weekend. Mulvaney would only say the offer was between Trump's $5.7 billion request and the $1.3 billion Democrats have offered. \"We moved off of the five and we hope they move up from their 1.3,\" Mulvaney said. A Democratic aide told the Associated Press that the offer from the White House on Saturday was $2.5 billion -- an initial $2.1 billion plus $400 million Democrats called a \"slush fund\" for the president's other immigration priorities. But Democrats complained Monday that it's unclear what Trump would actually accept. “[D]ifferent people from the same White House are saying different things about what the president would accept or not accept to end his Trump Shutdown, making it impossible to know where they stand at any given moment,” House Speaker-designate Nancy Pelosi, D-Calif., and Schumer, D-N.Y., said in a joint statement. “The president wanted the shutdown, but he seems not to know how to get himself out of it.” Senate negotiators are continuing talks behind the scenes with Democrats and Republicans. The House and Senate gaveled into session for a few minutes on Christmas Eve before quickly closing again with no further action. The White House, meanwhile, said Trump was meeting Monday afternoon with DHS Secretary Kristjen Nielsen and other department officials \"to discuss border security.\" In an earlier tweet on Monday, Trump blamed the Democrats for the stalemate: \"Virtually every Democrat we are dealing with today strongly supported a Border Wall or Fence. It was only when I made it an important part of my campaign, because people and drugs were pouring into our Country unchecked, that they turned against it. Desperately needed!\" The partial government closure affects hundreds of thousands of federal workers across the country and is expected to last at least through Thursday, when the House and Senate meet again. Monday and Tuesday, Christmas Eve and Christmas, respectively, are federal holidays, meaning the government would have been closed anyway. That means Wednesday is the first day the public could begin to feel the effects of lost government services, Mulvaney said. Mulvaney predicted the shutdown could go into January, when Democrats assume control of the House. \"It's very possible that this shutdown will go beyond the 28th and into the new Congress,\" he said. Mulvaney appeared on \"Fox News Sunday\" and ABC's \"This Week.\" <em>The Associated Press contributed to this report.</em>", "authors": "Andrew O'Reilly", "title": "‘All alone’ Trump prods Dems to confer on border wall amid partial shutdown"}, "https://www.foxnews.com/entertainment/taylor-swift-stage-crasher-arrested-san-diego-murder": {"content": "A California man who jumped on stage at a Taylor Swift concert in 2015 has been accused of beating a man to death earlier this month in San Diego. Christian Ewing, 29, initially was arrested Dec. 21 on a parole violation, police said. He was re-arrested Monday on suspicion of the murder of 57-year-old Gregory Freeman. Investigators said Freeman was attacked Dec. 5 in the city's Midway area and beaten with an object. Freeman died three days later. It was not immediately clear how detectives connected Ewing to the attack on Freeman. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Ewing sneaked into Swift's Aug 29, 2015 concert at San Diego's Petco Park and ran onto the stage while the \"Bad Blood\" singer was performing. He was tackled by security guards, one of whom suffered a broken rib. A San Diego police officer later testified that Ewing told authorities: \"I love that girl\" when asked why he rushed onstage. In March 2017, Ewing pleaded guilty to assault and violently resisting an officer in the performance of his duties and received two years' probation. At the time, San Diego County Deputy District Attorney Jessica Coto noted that Ewing had been arrested several times in multiple states, had an active warrant for a theft-related offense out of Florida and had a felony conviction for transporting drugs from out of state. <em>The Associated Press contributed to this report.</em> <a href=\"https://fox5sandiego.com/2018/12/24/police-make-arrest-in-fatal-midway-district-attack/\"><strong>Click for more from Fox 5 San Diego.</strong></a>", "authors": "Samuel Chamberlain", "title": "Taylor Swift concert intruder arrested in San Diego murder"}, "https://www.foxnews.com/opinion/silent-night-is-200-years-old-this-christmas-eve-heres-why-its-simple-message-is-still-so-powerful-today": {"content": "Fights over borders and wars are ripping Washington apart, but what we hear from afar gives us reason to take heart. It was 200 years ago this Christmas Eve, on a cold and snowy night in the small Austrian town of Oberndorf bei Salzburg, inside the small St. Nicholas Catholic parish church, that the beloved Christmas carol “Stille Nacht - Silent Night” debuted. The poem, penned two years earlier in 1816 by Josef Mohr, a 26-year-old priest, was set to music by 31-year-old Franz Gruber, a local teacher and the church’s organist. According to legend, the organ was broken that Christmas, a leather bellow gnawed thru by a mouse. Desperate for music that could be sung without its usual accompaniment, the tune was composed for guitar. But because the guitar was not an approved ecclesial instrument at the time, the new song was performed by the two men after Midnight Mass. Mohr played the guitar and Gruber sang bass. The church’s congregants sang the chorus. Music is often a mirror of the moment, and Mohr’s lyrics reflected a longing for peace and serenity at a time when the nerves of its impoverished citizens were raw from the ravages of the Napoleonic Wars. <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Yet the history of the world's third-best-selling single is a testament not only to warm seasonal sentiment and old-fashioned endurance – but to collaboration, cooperation and enterprise, hallmarks of most good endeavors that stand the test of time. The Mohr-Gruber partnership is well documented, and both men are deserving of credit for producing a piece so emotive and memorable that many, including President George H.W. Bush (and my own father), request it be sung to them on their deathbeds. Yet, in the spirit of Frank Capra’s perennial classic \"It’s a Wonderful Life,\" the success (or failure) of one always impacts the trajectory and outcome of others. This is certainly so in the case of \"Silent Night.\" Josef Mohr, the man responsible for authoring the poem that became the world’s most popular Christmas carol, was born out of wedlock, a scandal that threatened to stigmatize the youngster for life. It was Johann Nepomuk Hiernle, the local choir vicar in Salzburg, who overlooked the cultural prejudice, saw his talent and began financially and personally investing in the youngster, mentoring and supporting him throughout his childhood. In Hiernle, Mohr had found a champion who cheered him on. Aside from perhaps long-distant relatives, Andreas Peterlechner, a school teacher and Simon Dobler, a pastor in Hochburger, Austria, are names that history has all but forgotten. But it was Mssrs. Peterlechner and Dobler who first identified the musical gifts of Gruber. They nurtured his talent and encouraged him to study under Georg Hartdobler, a highly respected musician who taught the youngster to play the organ. But how does a single song, composed and sung by two seemingly obscure artists, first performed in a small church in Austria, somehow rise to enduring, world-wide fame? Enter Karl Mauracher, a repairman summoned to patch the hole in St. Nicolas’ organ. Taken by the piece, he introduced the music to two friends, both of whom were members of Austrian folk singing families. The Rainers and the Strassers were equally enamored with the music and added the piece to their international shows. Audiences loved it. The Rainers first performed \"Silent Night\" in New York City in 1839. It’s been sung every Christmas since. George Bailey’s guardian angel, Clarence Odbody, was right when he said that one man’s life touches so many others.  Indeed, a single song, like almost anything else, is rarely a single act of genius, and its composition and distribution are dependent upon an anonymous army laboring behind the scenes. The bicentennial commemoration of Mohr’s carol reminds us that behind the holiday’s trappings and traditions, beyond the legends and lights and the songs, there rests a story behind the story, and never more so than at Christmas. The Incarnation, the Christian belief that God is the King who came quietly to earth in the form of a helpless baby on a silent night in Bethlehem, is the ultimate mystery and miracle by which even the years on the calendar are still measured. Millennia have come and gone and yet it still draws the Christian faithful to sing the same song first sung on a cold Christmas Eve 200 years ago.", "authors": "Paul J. Batura", "title": "Paul J. Batura: Why this tune’s message is still so powerful today"}, "https://www.foxnews.com/politics/trump-brags-about-contract-for-wall-texas-blames-dems-for-partial-shutdown": {"content": " President Trump took to Twitter early Christmas Eve evening to brag about his latest border-wall accomplishment while blaming Democrats for the stalemate that has shut down part of the federal government. He tweeted Monday: “I am in the Oval Office &amp; just gave out a 115 mile long contract for another large section of the Wall in Texas. We are already building and renovating many miles of Wall, some complete. Democrats must end Shutdown and finish funding. Billions of Dollars, &amp; lives, will be saved!” It’s unclear whether Trump’s tweet means a new contract or an existing one. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Little headway has been made on the wall, despite Trump’s tweet, echoing one of his original promises as president while on the campaign trail. A March bill included money for 33 miles of barrier construction in South Texas’ Rio Grande Valley, but work there has yet to begin. <a href=\"https://www.foxnews.com/us/145m-border-wall-project-in-texas-awarded-customs-and-border-protection-says\">Customs and Border Protection announced in early November</a> a $145 million construction project was awarded to build roughly six miles of border wall in Texas. The agency, in conjunction with the Army Corps of Engineers, gave the multimillion-dollar job in the Border Patrol’s Rio Grande Valley Sector to SLSCO, which is expected to kick off in February. Other work has merely replaced existing barriers that had been deemed “ineffective,” not added miles. It looks like Christmas will be over and done with before the government will have a chance to get fully back to business. The incoming <a href=\"https://www.foxnews.com/politics/all-alone-trump-prods-dems-to-deal-on-border-wall-as-partial-shutdown-drags-on\">acting White House Chief of Staff Mick Mulvaney said</a> the partial shutdown could drag into the New Year. Monday and Tuesday, Christmas Eve and Christmas, respectively, are federal holidays, meaning the government is closed anyway. That means Wednesday is the first day the public could begin to feel the effects of lost government services, Mulvaney said. Funding for numerous departments and agencies expired Saturday. The disruption is affecting many operations and some 800,000 federal employees. Both the House and Senate have adjourned until later in the week. The president’s border-security meeting Monday afternoon included Homeland Security Secretary Kirstjen Nielsen and other department officials, White House Press Secretary Sarah Sanders said. Senate negotiators continued talks behind the scenes with Democrats and Republicans. The House and Senate briefly gaveled into session on Christmas Eve before closing again with no further action. The White House insisted Trump will reject any deal that does not include money for a wall or fence; Democrats held firm in their opposition to a wall or other physical barrier. As Republicans prepare to relinquish their hold on government, with Democrats taking control of the House in January, the opportunities — and limits — of the GOP alliance with the Trump White House may be running their course. <a href=\"https://www.foxnews.com/us/judge-blocks-deportation-of-honduran-mother-without-daughter\"><strong>JUDGE BLOCKS DEPORTATION OF HONDURAN MOTHER WITHOUT HER DAUGHTER</strong></a> No sooner had Trump signaled he might be backing off his demand for $5 billion to build a border wall with Mexico — easing away from a partial government shutdown — than he took a U-turn after being scolded by conservative allies and pundits, who accused him of wavering on a campaign promise. “Trump is plunging the country into chaos,” the Democratic leaders Nancy Pelosi and Chuck Schumer said in a joint statement on Christmas Eve. “Instead of bringing certainty into people’s lives, he’s continuing the Trump Shutdown just to please right-wing radio and TV hosts.” Trump told Republican leaders at the White House last week he wouldn’t sign a Senate-passed compromise bill, which would have kept border security money at $1.3 billion. <em>The Associated Press contributed to this report.</em>", "authors": "Frank Miles", "title": "Trump brags about contract for wall in Texas, blames Dems for partial shutdown"}, "https://www.foxnews.com/politics/house-dem-calls-for-lawmakers-gym-sauna-to-close-during-partial-shutdown": {"content": "If the government is partially closed, then the gym and sauna lawmakers enjoy should be closed too, one congressman has argued. In legislation introduced over the weekend, Rep. Bill Foster, D-Ill., called for the gym and sauna reserved for Congress members to be closed amid the shutdown. Foster, in his Shutdown Prioritization Act proposal, argued that Congress should be working toward ending the shutdown – not on working out. \"During the Trump Shutdown, not only are Members still able to access the taxpayer-funded gym, sauna, and steam room while tens of thousands of federal employees remain furloughed, but janitorial staff are still required to clean the gym and restock it with towels and other 'essential items,'\" Foster wrote in a statement, according to <a href=\"https://thehill.com/homenews/house/422727-dem-calls-for-lawmaker-gym-and-sauna-to-be-closed-during-government-shutdown\">The Hill</a>. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> The partial government shutdown, which began at 12 a.m. Saturday morning, entered its third day on Monday with no clear end in sight and without a consensus on spending and border security. Incoming acting White House chief of staff Mick Mulvaney said it was \"very possible\" <a href=\"https://www.foxnews.com/politics/partial-government-shutdown-will-likely-go-past-dec-27-mulvaney-says\">the shutdown would last into early 2019</a>. President Trump, meantime, tweeted Monday that he was <a href=\"https://www.foxnews.com/politics/all-alone-trump-prods-dems-to-deal-on-border-wall-as-partial-shutdown-drags-on\">\"all alone\" in the White House</a>, \"waiting for the Democrats to come back and make a deal on desperately needed Border Security.”", "authors": "Matt Richardson", "title": "House Dem calls for lawmakers' gym, sauna to close during partial shutdown"}, "https://www.foxnews.com/us/christmas-dreaming-big-young-entrepreneurs-starting-age-9": {"content": "With the rise of selling platforms like Shopify, Amazon and Etsy, young entrepreneurs are getting an early start at making their mark. Take Zandra Cunningham, of Buffalo, NY, who at age 9 created Zandra Beauty, an all-natural skin-care line aimed at teen girls. “I was obsessed with lip balms and asked my dad to buy some, but he told me ‘No — make your own,’ ” says Cunningham , now 18. “I researched YouTube and made some in simple bubble-gum flavor, using a kit. I passed it around at church and a lady gave me a dollar. I knew I could make money off it.” Cunningham next developed soaps, sugar scrubs and body butters. Her products were a hit at area vending events, but not all artisan markets took her seriously, so, “I set up an online shop on Etsy,” she says. Cunningham became the platform’s youngest seller to compete in its Open Call competition, during which sellers pitch buyers of retail stores. “Paper Source picked me and placed an order for 8,000 units,” Cunningham says. Participation in a KidBiz summer program at SUNY Buffalo State taught her business etiquette. She also completed an adult entrepreneurship program , through which she developed a business plan, gained a mentor, and defined her business goals. In 2013, Cunningham became a girls rights ambassador, for a women empowerment organization, prompting her to incorporate social responsibility into her business. “Finding out that girls are being enslaved and not allowed to go to school led me to donate 10 percent of my proceeds to this cause,” she says. Cunningham was eventually featured on the “Today Show,” catapulting sales. “By 2016, we grossed $100,000 in sales, and for 2018, we’re anticipating $1 million,” says Cunningham. Today, both of her parents work for her business full-time — Dad is the CFO and “Mom does marketing and operations,” says Cunningham, who remains CEO. She’s currently a freshman at SUNY University at Buffalo, majoring in business. “My goal is to transfer to an Ivy League school and get my MBA. I want to grow my business and learn skills I can to apply to my company,” she says. <strong><a href=\"https://nypost.com/2018/12/24/these-young-entrepreneurs-are-dreaming-big-this-christmas/\">Click for more from The New York Post.</a></strong>", "title": "Dreaming big this Christmas: Young entrepreneurs, starting at age 9"}, "https://www.foxnews.com/health/kansas-man-getting-christmas-wish-for-2-front-teeth-after-present-wrapping-disaster": {"content": " A Kansas man who lost his front tooth while scrambling to wrap Christmas presents last year will get his wish for two front teeth after a video of him singing a popular holiday jingle was posted to Facebook and set off a chain of secret events. Evans Kamuru, of Olathe, explained that he needed to cut tape quickly last year and decided to use his teeth. “Not the best idea,” <a href=\"https://fox4kc.com/2018/12/20/all-this-olathe-man-wants-for-christmas-are-his-2-front-teeth-and-hes-getting-them/\">he told Fox 4 KC.</a> “And as I was doing it, I felt something literally fly out of my mouth. Right on the carpet was my upper front tooth.” <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Days later, his other front tooth fell out while eating waffles. With the cost of dental implants not in the family’s budget, Kamuru had been using a plastic filled-in tray that has to be removed before he eats, <a href=\"https://fox4kc.com/2018/12/20/all-this-olathe-man-wants-for-christmas-are-his-2-front-teeth-and-hes-getting-them/\">Fox 4 KC reported.</a> But last Saturday, the father-of-three was presented with a surprise check to cover the cost of the 8-month implant process from members of his church. Unbeknownst to him, the video he posted last year singing “All I Want for Christmas Is My Two Front Teeth,” had set off a firestorm of secret fundraising efforts by members of the Gospel Outreach Center. In total, about 300 people contributed to the funds totaling over $14,500. A local dentist, Gordon Dental of Leawood, is also offering the procedure at a discount, <a href=\"https://fox4kc.com/2018/12/20/all-this-olathe-man-wants-for-christmas-are-his-2-front-teeth-and-hes-getting-them/\">Fox 4 KC reported.</a> <a href=\"https://www.foxnews.com/health/moms-suspected-cancer-was-actually-miracle-pregnancy\"><strong>MOM'S SUSPECTED CANCER WAS ACTUALLY 'MIRACLE' PREGNANCY</strong></a> “Just to think that they went out of their way to do this for us is very touching and humbling,” Kamuru told the news outlet. “God cares, even about the little details of our lives that sometimes you don’t think about.” On Dec. 21, Kamuru posted a video of his first appointment thanking his supports and God for the opportunity. “I’ll keep you posted, but hey, looks like I am going to get my two front teeth, two front teeth, see my two front teeth, thank you that I’ll get my two front teeth so I could wish you all a Merry Christmas,” he partially sang. On Sunday, he posted that he was recovering well from his extractions. He also joked that had learned his lesson, and that this year he got easy-to-cut tape to wrap presents and that he won’t be using his teeth.", "authors": "Alexandria Hein", "title": "Man gets wish for '2 front teeth' after present-wrapping disaster"}, "https://www.foxnews.com/world/mexican-governor-senator-killed-in-helicopter-crash": {"content": "The newly elected governor of Mexico's Puebla state and her husband, a federal senator and former governor of the state, were killed Monday in what local media report was a helicopter crash. Mexican President Manuel Lopez Obrador has expressed his \"deepest condolences\" via Twitter to the family of Puebla Gov. Martha Erika Alonso and ex-Gov. Rafael Moreno Valle. Both victims were members of the conservative National Action Party. Party leader Marko Cortes tweeted: \"I deeply regret the fatal accident in which Martha Ericka Alonso, Rafael Moreno Valle and other people lost their lives. May they rest in peace.\" Cortes added that the party was \"in mourning.\" Alonso took office as governor less than two weeks ago. Moreno Valle governed the central state from 2011 to 2017 and was currently a federal senator. The Reforma newspaper reported that the helicopter took off from Puebla's eponymous capital city and crashed in Huejotzingo, about 20 miles away. The result of the July vote in which Alonso won office was disputed by Lopez Obrador's Morena party, which alleged that it was marred by widespread irregularities and manipulated by Moreno Valle in order to hand power to his wife. But independent electoral authorities upheld the result and she was sworn into office Dec. 14. Government agencies and officials from former President Enrique Pena Nieto to Mexico City Mayor Claudia Sheinbaum also expressed condolences via statements and social media. <em>The Associated Press contributed to this report.</em>", "authors": "Samuel Chamberlain", "title": "Mexican governor, senator killed in helicopter crash"}, "https://www.foxnews.com/us/kelsey-berreth-disappearance-evidence-found-in-search-for-colorado-mom-police-say": {"content": " Police investigating the disappearance of a Colorado mother who was last seen Thanksgiving Day revealed they've discovered evidence in Idaho, more than 700 miles away from her home. Investigators in Idaho, where 29-year-old Kelsey Berreth’s phone last pinged three days after her disappearance, announced in <a href=\"https://www.tfid.org/CivicAlerts.aspx?AID=946\">a statement</a> Saturday that multiple search warrants were served along with the recovery of “some items” of evidence in Twin Falls, about two hours southeast of Boise. Officials have not yet revealed exactly what evidence was discovered. <strong><a href=\"https://www.foxnews.com/apps-products\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Berreth, a flight instructor, was last seen shopping with her 1-year-old daughter Kaylee at a supermarket in Woodland Park, south of Denver, on Thanksgiving Day. Her mother reported her missing Dec. 2. The 29-year-old’s cellphone pinged three days after her disappearance in Gooding, Idaho, nearly 700 miles away from her home and about 40 miles away from Twin Falls where evidence was recovered. Berreth’s boss at Doss Aviation also received a text from her cellphone saying she wouldn’t be at work the next week. <strong><a href=\"https://www.foxnews.com/us/colorado-mom-kelsey-berreth-missing-since-thanksgiving-a-timeline-of-events\">TIMELINE OF COLORADO MOM KELSEY BERRETH'S DISAPPEARANCE</a></strong> Berreth’s fiancé Patrick Frazee, 32, was charged Friday with first-degree murder after Woodland Park police gathered enough evidence at her home to believe that her death occurred there. “Investigators have recovered items at Kelsey’s residence to make us believe the crime happened there,” Police Chief Miles De Young said at a news conference. He also said: “As you can tell, sadly, we do not believe Kelsey is alive.” <em>Fox News' Robert Gearty contributed to this report.</em>", "authors": "Madeline Fish", "title": "‘Evidence’ found in hunt for Colorado mom missing since Thanksgiving"}, "https://www.foxnews.com/opinion/anna-kooiman-fox-news-has-brought-me-home-for-the-holidays-from-australia": {"content": "No Christmas with the kangaroos this year! I’m home for the holidays and I couldn’t be more excited. Fox News has brought me back to New York City from Australia, the Land Down Under. Normally I wouldn’t be putting my hand up to work holidays or overnight hours, but I never pass up on an opportunity when the producers invite me back. I’ll be anchoring the overnight cut-ins and also making a guest appearance on “Fox &amp; Friends” on New Year’s Day. I’ll be on with my baby to demonstrate some mommy fitness routines just in time for New Year’s resolutions. How special that his first Christmas will be spent in the Big Apple! <a href=\"https://www.foxnews.com/opinion/anna-kooiman-i-fly-solo-around-the-world-with-my-baby-this-is-how-i-survive\"><strong>ANNA KOOIMAN: I FLY SOLO AROUND THE WORLD WITH MY BABY – THIS IS HOW I SURVIVE</strong></a> Last year at this time, while living half a world away, I was heavily pregnant, hormonal and missing my mommy! Ha! I actually wrote a piece for Fox News about how I was trying to feel home for the holidays in Sydney, Australia, despite the 100-degree heat and Aussies not celebrating Thanksgiving. Last year at this time I was taking dips in the ocean for my swollen feet and stuffing my face and pregnant belly with Kooiman family recipes like Peppermint Forest Christmas Pecans. This year I’ll get to have those same Kooiman Christmas pecans made by my mamma (who is now a grandmamma) instead. I’ll also get to show viewers on my old morning show how I lost the baby weight. The weight I put on by eating those Christmas goodies! I do love my life in Australia. Since moving there, I have had a baby boy, done a lot of Aussie TV work, started teaching fitness classes again (something I did before working at Fox News), and launched an online fitness business called Strong Sexy Mammas. It’s aimed at helping other new moms get their groove back both physically and emotionally through exercise. <a href=\"https://www.foxnews.com/category/special/occasions/christmas\"><strong>CLICK HERE TO READ MORE FROM OUR CHRISTMAS COVERAGE</strong></a> I am so excited to come back on “Fox &amp; Friends,” this time as a guest, with my baby son, Brooks. We’re booked to come on New Year’s Day to demonstrate some baby-involved workouts! What a perfect day to be talking about healthy living, after we’ve all been enjoying our holiday tasty treats. It was incredibly tough leaving my job hosting “Fox &amp; Friends Weekend” and I am so thankful Fox News keeps inviting me back for little stints. It helps make me feel connected to my country and my family, which is so important for international couples. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> I hope it fits into our family plan to come back one day! In the meantime, I’ll enjoy visiting my old pals at Fox News, singing Christmas carols with Brooks’ grandparents, window shopping on 5th Avenue, and ice skating in Central Park. I look forward to seeing the Fox News viewers while anchoring the overnight cut-ins and making the guest appearance with Brooks on “Fox &amp; Friends” on New Year’s Day!", "authors": "Anna Kooiman", "title": "ANNA KOOIMAN: Fox News brought me home for the holidays from Australia"}, "https://www.foxnews.com/world/mastermind-of-backpacker-beheadings-arrested-moroccan-officials-say": {"content": "Morocco's counterterrorism chief said Monday that five more people have been arrested in connection with the horrific ISIS-inspired murders of two Scandinavian hikers in the High Atlas mountains, including the so-called \"emir\" who masterminded the killings. Abdelhak Khiam, the head of the country's central office for judicial investigation, identified the alleged ringleader to Agence France-Presse as Abdessamad Ejjoud, a 25-year-old street vendor who lived on the outskirts of Marrakech. Khiam said Ejjoud had \"formed a kind of cell that discussed how to carry out a terrorist act inside the kingdom ... targeting the security services or foreign tourists.\" A total of 18 people have been arrested in the murders of 28-year-old Norwegian Maren Ueland and 24-year-old Dane Louisa Vesterager Jespersen, whose bodies were found Dec. 17. Khaim said three of those arrested had terror-related criminal records. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Ejjoud was believed to have carried out the murders along with 33-year-old Abderrahim Khayali, 27-year-old Younes Ouaziyad and 33-year-old Rachid Afatti. Investigators have said the four men shot a video the week before the murders in which they pledged allegiance to ISIS leader Abu Bakr al-Baghdadi. However, Khiam told AFP the four had not had contact with ISIS leaders \"in conflict zones, whether in Syria, Iraq or Libya.\" Nine of the 18 men were arrested on Friday. Officials said they were heading to the area where the women were beheaded with the intent to commit a crime. According to Boubker Sabik, a spokesman for the Moroccan security and domestic intelligence services, investigators found electronic devices, knives, bomb-making materials and unauthorized rifles. The killings have shocked Morocco, which has seen relatively few acts of terror compared to its North African and Middle Eastern neighbors. On Saturday, hundreds of people took part in a candlelit vigil outside the Norwegian and Danish embassies in the capital, Rabat. Some carried flowers, while others held banners that said \"Sorry.\" \"Words cannot describe this barbaric crime,\" said Khalil Bensalmi, in his fifties, who came to the vigil with his two daughters. \"This doesn't at all represent Moroccan society or its pacifist culture.\" Ratiba Naji, a housewife, tried to hold back her emotions as she said, \"It's horrendous. These girls deserve life. Their parents must be devastated. I am sorry.\" <strong><a href=\"https://www.foxnews.com/world/arrests-in-morocco-backpacker-beheadings-foiled-terrorist-plot-investigators-reveal\">ARRESTS IN MOROCCO BACKPACKER BEHEADINGS FOILED 'TERRORIST PLOT,' INVESTIGATORS REVEAL</a></strong> The killings marked the first terrorist attack to hit Morocco since 2011, when a suicide bomber detonated in Marrakech and killed 16 people. More than 1,000 Moroccans have joined ISIS in recent years, and Moroccan authorities arrested 20 cells with terrorist affiliations between 2017 and 2018. <em>The Associated Press contributed to this report.</em>", "authors": "Samuel Chamberlain", "title": "'Mastermind' of backpacker beheadings arrested, Moroccan officials say"}, "https://www.foxnews.com/politics/dems-accused-of-religious-bigotry-for-questioning-trump-court-picks-knights-of-columbus-ties": {"content": " Following <a href=\"https://www.foxnews.com/politics/harris-and-hirono-question-federal-judicial-nominee-over-knights-of-columbus-membership\">questions from multiple Democratic senators</a> over the impartiality of Trump judicial nominee Brian Buescher and his ties to the Knights of Columbus, a charitable Roman Catholic organization, Republicans and various religious leaders hit back Monday against “religious bigotry.” “This isn’t just about the Knights of Columbus or Catholics, this is an ongoing attack from the extremist left of the Democratic Party to silence people of faith and run them out of engaging in public service based on their religious beliefs,” Penny Nance, the president of Concerned Women for America, a Christian women’s activist group, said in a written statement. “It is pure and simple religious bigotry,” Nance added.  <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Sens. Kamala Harris, D-Calif., and Mazie Hirono, D-Hawaii, recently raised concerns about Buescher's membership as part of the Senate Judiciary Committee's review of his nomination by President Trump to sit on the U.S. District Court in Nebraska. <a href=\"https://www.catholicnewsagency.com/news/senators-quiz-nominee-about-membership-of-extreme-knights-of-columbus-78683\">The Catholic News Agency (CNA)</a> first reported news of their concerns. In a series of questions sent to Buescher, Hirono asked whether his membership in the Knights of Columbus would prevent him from hearing cases “fairly and impartially” and, if confirmed, whether he would end his membership in the organization. “The Knights of Columbus has taken a number of extreme positions,” Hirono said in the questionnaire. “For example, it was reportedly one of the top contributors to California’s Proposition 8 campaign to ban same-sex marriage.” Harris meantime, in her questions to the nominee, called the Knights of Columbus “an all-male society” and asked the Nebraska lawyer if he was aware that the group was anti-abortion and anti-gay marriage when he joined. The California senator also referenced Supreme Knight Carl A. Anderson’s statement that abortion amounted to “the killing of the innocent on a massive scale” and asked Buescher if he agreed with the statement. “The Knights of Columbus does not have the authority to take personal political positions on behalf of all of its approximately two million members,” Buescher wrote in <a href=\"https://www.judiciary.senate.gov/imo/media/doc/Buescher%20Responses%20to%20QFRs.pdf\">reply to the queries</a>. “If confirmed, I will apply all provisions of the Code of Conduct for United States Judges regarding recusal and disqualification.” Prominent Republicans and religious leaders backed Buescher in the face of the questions. “Hopefully, in the eyes of Democrats you are not disqualified to a be a judge because of your religious affiliations and beliefs,” GOP South Carolina Sen. Lindsey Graham <a href=\"https://twitter.com/LindseyGrahamSC/status/1077260236786987008\">tweeted</a>. “The Knights of Columbus are a Catholic charitable organization who have genuinely held beliefs about marriage &amp; abortion.” “Will not tolerate disqualifying judicial nominees because of charitable works and personal religious opinions,” Graham wrote in a follow-up <a href=\"https://twitter.com/LindseyGrahamSC/status/1077260488550039552\">tweet</a>. \"The Black Church is very concerned because we know that when elected leaders attack Catholic organizations like the Knights of Columbus for believing timeliness Christian principles, then all people of faith are at risk,” Rev. Eugene F. Rivers III, a civil rights leader and the director of the Seymour Institute for Black Church and Policy Studies, said in a statement. “There is no place for a religious test like this in our country,” he continued. “Our constitution forbids it and elected leaders should know better than to try to impose it.\" This is the kind of thuggish behavior we expect from third world dictators, not United States Senators. \"This is the kind of thuggish behavior we expect from third world dictators, not United States Senators,\" Ken Blackwell, a former U.S. Ambassador to the United Nations Human Rights Commission, said in a statement. \"That this attack on Catholics comes from the party of John F. Kennedy, who was proudly a Knight of Columbus, is particularly shocking and egregious. There should be no religious test in America, and I call on my Democratic friends to end this tactic of engaging in religious discrimination to destroy people nominated for public office.\" “Alarming questions from Senate Democrats, showing they are getting more and more comfortable with imposing religious tests on Federal judicial nominees,” the office of Sen. Orrin Hatch, R-Utah, <a href=\"https://twitter.com/senorrinhatch/status/1076657983713533953\">tweeted</a> over the weekend. Kathleen Blomquist, a spokeswoman for the Knights of Columbus, blasted the questions by Hirono and Harris as a throwback to past anti-Catholic rhetoric. “Our country’s sad history of anti-Catholic bigotry contributed to the founding of the Knights of Columbus, and we are proud of the many Catholics who overcame this hurdle to contribute so greatly to our country,” she told the CNA. Despite the pointed questions of the nominee and the implications of the interrogations, Knights of Columbus Senior Vice President Kevin Shinkle said the organization has valued the backing it's received. “The Knights of Columbus is grateful for the support of so many people who recognize our charitable efforts and understand that mainstream religious beliefs shouldn’t disqualify anyone from serving their country,” Shinkle said in a statement to Fox News. <i>Fox News’ Andrew O’Reilly contributed to this report.</i>", "authors": "Matt Richardson", "title": "Dems slammed for questioning Trump court pick’s Knights of Columbus ties"}, "https://www.foxnews.com/us/california-gov-brown-orders-new-dna-testing-in-35-year-old-murders": {"content": "A California inmate charged in a decades-old murder case could get a second chance after Democratic Gov. Jerry Brown on Monday ordered new DNA tests related to the killings. Kevin Cooper has argued that he was framed for the 1983 Chino Hills hatchet and knife killings of four people. Brown ordered a T-shirt, towel, a sheath and a hatchet handle discovered near the scene to be tested. Brown also appointed a retired Los Angeles County Superior Court judge to serve as a special master overseeing the case. <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Cooper was convicted of killing Doug and Peggy Ryen, their 10-year-old daughter Jessica and 11-year-old neighbor Christopher Hughes in 1985. Prosecutors said Cooper's claims of innocence have been disproven multiple times, including by prior DNA testing, but Cooper and his attorney argued evidence against him was planted. Now they will have an opportunity to prove their case. \"I take no position as to Mr. Cooper's guilt or innocence at this time, but colorable factual questions have been raised about whether advances in DNA technology warrant limited retesting of certain physical evidence in this case,\" Brown wrote in his executive order. The purpose of the new testing, he wrote, would be to determine whether another suspect's DNA or the DNA of any other identifiable suspect is on the items. If the tests reveal no new DNA or DNA that cannot be traced to a person, \"this matter should be closed,\" Brown wrote. Following the announcement of the order, Kim Kardashian, <a href=\"https://www.foxnews.com/entertainment/kim-kardashian-advocates-for-alice-johnson-others-who-are-jailed\">a vocal advocate for criminal justice reform</a>, tweeted in support, labeling it \"such amazing news.\" Brown issued his Christmas Eve order alongside 143 pardons and 131 commutations. They are expected to be his last clemency actions as governor, but he has until he leaves office Jan. 7 to act. <i>The Associated Press contributed to this report.</i>", "authors": "Matt Richardson", "title": "California Gov. Brown orders new DNA testing in 35-year-old murders"}, "https://www.foxnews.com/us/san-francisco-mayors-plea-to-get-older-brother-convicted-of-manslaughter-out-of-jail-2-decades-early-denied": {"content": "In keeping with his tradition of granting clemency on or near major holidays, California Gov. Jerry Brown granted 143 pardons and 131 commutations on Christmas Eve. However, he did not show leniency to the older brother of San Francisco Mayor London Breed, who has served nearly two decades of a 44-year sentence for manslaughter, according to reports. <a href=\"https://www.sfchronicle.com/bayarea/article/SF-Mayor-Breed-s-effort-to-free-brother-turned-13489538.php?fbclid=IwAR1ut9CA1QjfhZgiSR4gtl3foK-L5jb3eNPD9yCHdQNtnvmUS198w06lSO0#photo-16679386\">The San Francisco Chronicle</a> reported that Breed’s brother, Napoleon Brown, was not pardoned despite her family’s request. <a href=\"https://www.foxnews.com/politics/sf-mayor-trying-to-get-brother-a-convicted-killer-out-of-lockup-20-years-early\">Breed said last week</a> that people who break the law should face consequences, but also have a chance at redemption. “Too many people, particularly young black men like my brother was when he was convicted, are not given an opportunity to become contributing members of society after they have served time in prison,” she said. <strong><a href=\"https://www.foxnews.com/apps-products\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Brown, who struggled with drugs from a young age, recently was caught with heroin in prison and had two years added to his sentence, <a href=\"https://www.nbcbayarea.com/investigations/San-Francisco-Mayor-London-Breed-Requests-Brothers-Early-Release-503093911.html?_osource=SocialFlowFB_BAYBrand&amp;fbclid=IwAR269O7KIVpwBeU8ya3YbYS_ogYu3IYW6oC2Yttn4tBDH4-m7j5S0jzVB0w\">KNTV</a> reported. Breed, 44, who was a defense witness for her brother at his trial, has spoken out about her rough upbringing in San Francisco public housing. Her brother, who is now 46, pushed Lenties White from a getaway car on the Golden Gate Bridge after an armed robbery in June 2000. White, 25, was struck by a vehicle and died. Sandra McNeil, the mother of the victim, said Brown does not deserve early release. <a href=\"https://www.foxnews.com/politics/sf-mayor-trying-to-get-brother-a-convicted-killer-out-of-lockup-20-years-early\"><strong>SAN FRANCISCO MAYOR TRYING TO GET BROTHER OUT OF LOCKUP 20 YEARS EARLY</strong></a> “I don’t think it would be justice,” she said. “She’s the mayor, so she’s got a little power, so she thinks she can get her brother out.” Among those who were granted Christmas Eve pardons by Brown are five refugees from Cambodia and an immigrant from Honduras -- all of whom are facing the possibility of deportation because of criminal convictions -- two people who lost their homes in a recent wildfire and a former state official. Brown's commutations included several former gang members who have renounced their former ties and will now have an opportunity to petition the parole board for early release. Gov. Brown has now granted 283 commutations and 1,332 pardons since returning to office in 2011, far more than any California governor since at least the 1940s. The governor needs approval from the state Supreme Court to pardon or commute the sentence of anyone twice convicted of a felony. The court in recent weeks has rejected seven clemency requests by the governor, including one Monday. <em>The Associated Press contributed to this report.</em>", "authors": "Frank Miles", "title": "San Francisco mayor’s plea to get older brother, convicted of manslaughter, out of jail 2 decades early denied"}, "https://www.foxnews.com/politics/trump-in-christmas-eve-phone-call-asks-child-if-they-still-believe-in-santa-claus": {"content": "President Trump and First Lady Melania Trump made a series of Christmas Eve phone calls on Monday, punctuated by an exchange in which the president apparently questioned a child’s belief in Santa Claus. “Are you still a believer in Santa?” the president could be heard asking the child over the phone. “Because at 7, it’s marginal, right?” Trump then chuckled before concluding the call with the child. “You just go enjoy yourself,” he said into the receiver. The calls were made in conjunction with the North American Aerospace Defense Command (NORAD) and the organization's \"Santa tracker.\" <a href=\"https://www.foxnews.com/apps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> \"Helping children across the country track #Santa is becoming one of my favorite traditions! @Potus and I enjoyed working with @NORADSanta,\" the first lady tweeted following the calls. Both the president and first lady are celebrating Christmas in the White House after Trump said he would be staying in D.C. following the partial government shutdown that went into effect Saturday morning. “I will not be going to Florida because of the Shutdown - Staying in the White House,” the president <a href=\"https://twitter.com/realDonaldTrump/status/1076628127525294080\">tweeted</a> alongside a MAGA hashtag.", "authors": "Matt Richardson", "title": "Trump, in Christmas Eve phone call, asks child if they still believe in Santa Claus"}, "https://www.foxnews.com/entertainment/ben-stiller-fires-back-after-shawskank-calls-him-a-liar": {"content": "Ben Stiller has a message for Joyce “Tillie” Mitchell — aka the “Shawskank” — following her claims that his hit Showtime mini-series “Escape at Dannemora” is filled with “lies.” “It’s not a documentary,” explained Stiller, speaking to Deadline about Mitchell’s jailhouse assessment to The Post on Sunday. “We did have to create scenes based on us inferring what we believed to be the truth.” “My guideline was always to try and tell what I thought happened,” Stiller added. “This was a story I wanted to tell in as full a way as possible and really tried to take into account the context of the world that everyone was living in. And the reality of what it means to be a worker in a prison and the situation that everybody deals with up there in that part of the state. I was just trying to tell the story in as real and hopefully as entertaining a way as possible without exploiting.” <a href=\"https://www.foxnews.com/entertainment/ben-stiller-says-he-apologized-for-simple-jack-stands-by-shaun-white\"><strong>BEN STILLER,  SAYS HE APOLOGIZED FOR 'SIMPLE JACK,' STANDS BY SHAUN WHITE</strong></a> Mitchell, 54, blasted Stiller during her Post interviews last week at Bedford Hills Correctional Facility in Westchester — where she’s currently serving a seven-year sentence for the 2015 prison break that was the basis for “Escape at Dannemora” — for portraying her as a lovesick prison seamstress. Stiller directs the Showtime series and there are several scenes showing Mitchell having consensual sex with convicted killers David Sweat and Richard Matt, who were at the center of the three-week manhunt. “I never had sex with them,” seethed Mitchell. “Ben Stiller is a son-of-a-b***h liar.” To read more from The New York Post, <a href=\"https://nypost.com/2018/12/24/ben-stiller-fires-back-after-shawskank-calls-him-a-liar/\">click here</a>.", "title": "Ben Stiller fires back after 'Shawskank' calls him a liar"}, "https://www.foxnews.com/us/kentucky-cop-killed-in-fiery-crash-driver-charged-with-murder-and-dui-report": {"content": "A police officer in Kentucky died Christmas Eve while she conducted a traffic stop and was hit while inside her cruiser, which caught fire while she was trapped inside, WDRB.com <a href=\"https://www.wdrb.com/news/man-charged-with-murder-dui-in-connection-with-fiery-crash/article_64e7d16a-07b2-11e9-bb13-d304213d2c48.html?mode=nowapp\">reported.</a> Louisville Metro Police Detective Deidre Mengedoht, 32, served on the force for more than seven years and reportedly leaves behind a  young son. Roger Burdette, 60, was charged with murder of a police officer and DUI, the report said. Reports said that Mengedoht had her emergency lights on while conducting the stop on the I-64. \"It’s very devastating to the department,\" David James, the Metro Council president <a href=\"https://www.wlky.com/article/my-sisters-were-scared-teen-saves-family-after-holiday-lights-ignite-house-fire/25671568\">told WLKY.com.</a> \"The officers that work with these officers that we’ve lost, it’s devastating to them also. It’s a big loss for them. The police department is like one giant family and they love one another, so it’s just very hard.”", "title": "Kentucky cop killed in fiery crash; driver charged with murder and DUI: report"}}